src/python核心编程.org
#+OPTIONS: ^:nil
* python对象
** python对象
python对象拥有三个特性
+ 身份 使用内建函数id()得到这个值
+ 类型 使用内建函数type()得到对象类型
+ 值
** 标准类型
数字、整形、布尔型、长整形、浮点型、复数型、字符串、列表、元组、字典
** 其他内建类型
类型、None、文件、集合、函数/方法、模块、类
*** 类型本身也是对象
#+BEGIN_SRC python
>>> type(42)
<type 'int'>
>>> type(type(42))
<type 'type'>
#+END_SRC
*** 测试值为false的对象
+ None False "" [] () {} 所有值为零的数
+ 如果是用户自己创建的类实例，如果nonzero(__nonzero__())或length(__len__())的值为零，其布尔值也是false
** 标准类型运算符
*** 值比较
== != > >= < <=
*** 对象身份比较
变量名是对象的引用，对象身份比较用于判断两个引用是否指向同一个对象。使用is和is not比较两个对象的身份。
#+BEGIN_SRC python
>>> a = 3
>>> b = 3
>>> a is b
True
>>> a = 3.5
>>> b = 3.5
>>> a is b
False
>>> a = 3.5
>>> b = a
>>> a is b
True
>>> a = b = 3.5
>>> a is b
True
#+END_SRC
*** 逻辑运算符
+ and
+ or
+ not
** 标准类型的内建函数
#+ATTR_HTML: border="2" rules="all" frame="border"
| 函数            | 功能                                                                                   |
|-----------------+----------------------------------------------------------------------------------------|
| cmp(obj1, obj2) | 比较obj1和obj2的值，返回大于零(obj1>obj2)、小于零(obj1<obj2)、等于零(obj1==obj2)的整数 |
| repr(obj)       | 返回一个对象的字符串表示                                                               |
| str(obj)        | 返回一个对象可读性好的字符串表示                                                           |
| type(obj)       | 得到一个对象的类型                                                                     |
** 类型工厂函数
python2.2统一了类型和类，所有的内建类型现在也都是类。
原来的内建转换函数像int()、str()现在都成了工厂函数。
它们看上去有点像函数，实际上它们是类。
** 标准类型的分类
#+ATTR_HTML: border="2" rules="all" frame="border"
| 数据类型 | 存储模型  | 更新模型 | 访问模型  |
|----------+-----------+----------+-----------|
| 数字     | Scalar    | 不可更改 | 直接访问  |
| 字符串   | Scalar    | 不可更改 | 顺序访问  |
| 列表     | Container | 可更改   | 顺序访问  |
| 元组     | Container | 不可更改 | 顺序访问  |
| 字典     | Container | 可更改   | 映射访问  |
** 不支持的类型
+ char
+ byte

* 数字
** 整形
+ 布尔型
+ 标准整形 八进制以0开始，十六进制以0x开始
+ 长整形 以L结尾
标准整形超出范围会自动转化为长整形
#+BEGIN_SRC python
>>> 9999 ** 8
99920027994400699944002799920001L
#+END_SRC
** 双精度浮点数
** 复数
复数的内建属性
+ real 实部
+ imag 虚部
+ conjugate() 共轭
#+BEGIN_SRC python
>>> a = 3+5j
>>> a.real
3.0
>>> a.imag
5.0
>>> a.conjugate()
(3-5j)
#+END_SRC
** 运算符
