html/python核心编程.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>python核心编程</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="python核心编程"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-09-08T12:45+0800"/>
<meta name="author" content="王超"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">python核心编程</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 python对象</a>
<ul>
<li><a href="#sec-1-1">1.1 python对象</a></li>
<li><a href="#sec-1-2">1.2 标准类型</a></li>
<li><a href="#sec-1-3">1.3 其他内建类型</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1 类型本身也是对象</a></li>
<li><a href="#sec-1-3-2">1.3.2 测试值为false的对象</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4 标准类型运算符</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1 值比较</a></li>
<li><a href="#sec-1-4-2">1.4.2 对象身份比较</a></li>
<li><a href="#sec-1-4-3">1.4.3 逻辑运算符</a></li>
</ul>
</li>
<li><a href="#sec-1-5">1.5 标准类型的内建函数</a></li>
<li><a href="#sec-1-6">1.6 类型工厂函数</a></li>
<li><a href="#sec-1-7">1.7 标准类型的分类</a></li>
<li><a href="#sec-1-8">1.8 不支持的类型</a></li>
</ul>
</li>
<li><a href="#sec-2">2 数字</a>
<ul>
<li><a href="#sec-2-1">2.1 整形</a></li>
<li><a href="#sec-2-2">2.2 双精度浮点数</a></li>
<li><a href="#sec-2-3">2.3 复数</a></li>
<li><a href="#sec-2-4">2.4 运算符</a>
<ul>
<li><a href="#sec-2-4-1">2.4.1 混合模式</a></li>
<li><a href="#sec-2-4-2">2.4.2 算数运算符</a></li>
</ul>
</li>
<li><a href="#sec-2-5">2.5 用于数字类型的内建函数</a></li>
<li><a href="#sec-2-6">2.6 仅用于整数的函数</a></li>
<li><a href="#sec-2-7">2.7 bool</a></li>
</ul>
</li>
<li><a href="#sec-3">3 序列：字符串、列表和元组</a>
<ul>
<li><a href="#sec-3-1">3.1 序列类型操作符</a></li>
<li><a href="#sec-3-2">3.2 序列类型转换工厂函数</a></li>
<li><a href="#sec-3-3">3.3 序列类型可用的内置函数</a></li>
<li><a href="#sec-3-4">3.4 字符串</a>
<ul>
<li><a href="#sec-3-4-1">3.4.1 只适用字符串的操作符</a></li>
<li><a href="#sec-3-4-2">3.4.2 字符串内建函数</a></li>
<li><a href="#sec-3-4-3">3.4.3 unicode</a></li>
</ul>
</li>
<li><a href="#sec-3-5">3.5 列表</a>
<ul>
<li><a href="#sec-3-5-1">3.5.1 列表的内建函数</a></li>
</ul>
</li>
<li><a href="#sec-3-6">3.6 元组</a></li>
<li><a href="#sec-3-7">3.7 浅拷贝和深拷贝</a></li>
</ul>
</li>
<li><a href="#sec-4">4 映射和集合类型</a>
<ul>
<li><a href="#sec-4-1">4.1 字典</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1 创建字典</a></li>
<li><a href="#sec-4-1-2">4.1.2 访问字典中的值</a></li>
<li><a href="#sec-4-1-3">4.1.3 字典的键</a></li>
</ul>
</li>
<li><a href="#sec-4-2">4.2 映射类型相关函数</a>
<ul>
<li><a href="#sec-4-2-1">4.2.1 dict()</a></li>
<li><a href="#sec-4-2-2">4.2.2 映射类型的内建方法</a></li>
</ul>
</li>
<li><a href="#sec-4-3">4.3 集合</a>
<ul>
<li><a href="#sec-4-3-1">4.3.1 创建集合</a></li>
</ul>
</li>
<li><a href="#sec-4-4">4.4 集合类型的内建方法</a></li>
</ul>
</li>
<li><a href="#sec-5">5 条件和循环</a>
<ul>
<li><a href="#sec-5-1">5.1 条件和循环拾遗</a></li>
<li><a href="#sec-5-2">5.2 迭代器</a>
<ul>
<li><a href="#sec-5-2-1">5.2.1 如何迭代</a></li>
<li><a href="#sec-5-2-2">5.2.2 创建迭代器</a></li>
</ul>
</li>
<li><a href="#sec-5-3">5.3 列表解析</a></li>
<li><a href="#sec-5-4">5.4 生成器</a></li>
</ul>
</li>
<li><a href="#sec-6">6 文件和输入输出</a>
<ul>
<li><a href="#sec-6-1">6.1 文件内建函数open()和file()</a>
<ul>
<li><a href="#sec-6-1-1">6.1.1 文件对象的访问模式</a></li>
<li><a href="#sec-6-1-2">6.1.2 缓冲方式</a></li>
<li><a href="#sec-6-1-3">6.1.3 通用换行符支持</a></li>
</ul>
</li>
<li><a href="#sec-6-2">6.2 文件内建方法</a></li>
<li><a href="#sec-6-3">6.3 文件内建属性</a></li>
<li><a href="#sec-6-4">6.4 文件系统</a>
<ul>
<li><a href="#sec-6-4-1">6.4.1 os.path</a></li>
<li><a href="#sec-6-4-2">6.4.2 os</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-7">7 错误和异常</a>
<ul>
<li><a href="#sec-7-1">7.1 检测和处理异常</a>
<ul>
<li><a href="#sec-7-1-1">7.1.1 带有多个except的try语句</a></li>
<li><a href="#sec-7-1-2">7.1.2 处理多个异常的except语句</a></li>
<li><a href="#sec-7-1-3">7.1.3 捕获所有异常</a></li>
<li><a href="#sec-7-1-4">7.1.4 else子句</a></li>
<li><a href="#sec-7-1-5">7.1.5 finally子句</a></li>
</ul>
</li>
<li><a href="#sec-7-2">7.2 with语句</a></li>
<li><a href="#sec-7-3">7.3 触发异常</a>
<ul>
<li><a href="#sec-7-3-1">7.3.1 raise常见用法</a></li>
</ul>
</li>
<li><a href="#sec-7-4">7.4 断言</a></li>
<li><a href="#sec-7-5">7.5 标准异常</a></li>
</ul>
</li>
<li><a href="#sec-8">8 函数和函数式编程</a>
<ul>
<li><a href="#sec-8-1">8.1 函数拾遗</a></li>
<li><a href="#sec-8-2">8.2 装饰器</a></li>
<li><a href="#sec-8-3">8.3 参数</a></li>
<li><a href="#sec-8-4">8.4 函数式编程</a>
<ul>
<li><a href="#sec-8-4-1">8.4.1 lambda</a></li>
<li><a href="#sec-8-4-2">8.4.2 内建函数apply() filter() map() reduce()</a></li>
</ul>
</li>
<li><a href="#sec-8-5">8.5 变量作用域</a>
<ul>
<li><a href="#sec-8-5-1">8.5.1 global</a></li>
<li><a href="#sec-8-5-2">8.5.2 闭包</a></li>
</ul>
</li>
<li><a href="#sec-8-6">8.6 生成器</a></li>
</ul>
</li>
<li><a href="#sec-9">9 模块</a>
<ul>
<li><a href="#sec-9-1">9.1 搜索路径</a></li>
<li><a href="#sec-9-2">9.2 名称空间</a>
<ul>
<li><a href="#sec-9-2-1">9.2.1 名称空间的加载顺序</a></li>
<li><a href="#sec-9-2-2">9.2.2 名称查找</a></li>
</ul>
</li>
<li><a href="#sec-9-3">9.3 导入模块</a>
<ul>
<li><a href="#sec-9-3-1">9.3.1 模块导入的特性</a></li>
</ul>
</li>
<li><a href="#sec-9-4">9.4 内建函数</a>
<ul>
<li><a href="#sec-9-4-1">9.4.1 __import__()</a></li>
<li><a href="#sec-9-4-2">9.4.2 globals()和locals()</a></li>
<li><a href="#sec-9-4-3">9.4.3 reload()</a></li>
</ul>
</li>
<li><a href="#sec-9-5">9.5 包</a>
<ul>
<li><a href="#sec-9-5-1">9.5.1 导入子包</a></li>
<li><a href="#sec-9-5-2">9.5.2 __init__.py</a></li>
<li><a href="#sec-9-5-3">9.5.3 相对导入</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-10">10 面向对象编程</a>
<ul>
<li><a href="#sec-10-1">10.1 类</a>
<ul>
<li><a href="#sec-10-1-1">10.1.1 创建类</a></li>
<li><a href="#sec-10-1-2">10.1.2 类属性</a></li>
<li><a href="#sec-10-1-3">10.1.3 查看类的属性</a></li>
<li><a href="#sec-10-1-4">10.1.4 特殊的类属性</a></li>
</ul>
</li>
<li><a href="#sec-10-2">10.2 实例</a>
<ul>
<li><a href="#sec-10-2-1">10.2.1 创建实例</a></li>
<li><a href="#sec-10-2-2">10.2.2 实例属性</a></li>
<li><a href="#sec-10-2-3">10.2.3 查看实例属性</a></li>
<li><a href="#sec-10-2-4">10.2.4 特殊实例属性</a></li>
<li><a href="#sec-10-2-5">10.2.5 类数据属性 vs 实例数据属性</a></li>
</ul>
</li>
<li><a href="#sec-10-3">10.3 方法</a>
<ul>
<li><a href="#sec-10-3-1">10.3.1 静态方法和类方法</a></li>
</ul>
</li>
<li><a href="#sec-10-4">10.4 继承</a>
<ul>
<li><a href="#sec-10-4-1">10.4.1 创建子类</a></li>
<li><a href="#sec-10-4-2">10.4.2 继承</a></li>
</ul>
</li>
<li><a href="#sec-10-5">10.5 内建函数</a></li>
<li><a href="#sec-10-6">10.6 私有化</a></li>
</ul>
</li>
<li><a href="#sec-11">11 执行环境</a>
<ul>
<li><a href="#sec-11-1">11.1 执行代码对象(或代码字符串)</a>
<ul>
<li><a href="#sec-11-1-1">11.1.1 内建函数</a></li>
</ul>
</li>
<li><a href="#sec-11-2">11.2 执行其他python程序</a>
<ul>
<li><a href="#sec-11-2-1">11.2.1 导入</a></li>
<li><a href="#sec-11-2-2">11.2.2 exec</a></li>
<li><a href="#sec-11-2-3">11.2.3 execfile()</a></li>
</ul>
</li>
<li><a href="#sec-11-3">11.3 执行其他非python程序</a></li>
<li><a href="#sec-11-4">11.4 结束执行</a>
<ul>
<li><a href="#sec-11-4-1">11.4.1 sys.exit()</a></li>
<li><a href="#sec-11-4-2">11.4.2 os._exit()</a></li>
<li><a href="#sec-11-4-3">11.4.3 os.kill()</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> python对象</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> python对象</h3>
<div class="outline-text-3" id="text-1-1">

<p>python对象拥有三个特性
</p><ul>
<li>身份 使用内建函数id()得到这个值
</li>
<li>类型 使用内建函数type()得到对象类型
</li>
<li>值
</li>
</ul>

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 标准类型</h3>
<div class="outline-text-3" id="text-1-2">

<p>数字、整形、布尔型、长整形、浮点型、复数型、字符串、列表、元组、字典
</p></div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 其他内建类型</h3>
<div class="outline-text-3" id="text-1-3">

<p>类型、None、文件、集合、函数/方法、模块、类
</p>
</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> 类型本身也是对象</h4>
<div class="outline-text-4" id="text-1-3-1">




<pre class="src src-python">&gt;&gt;&gt; <span style="color: #483d8b;">type</span>(42)
&lt;<span style="color: #483d8b;">type</span> <span style="color: #8b2252;">'int'</span>&gt;
&gt;&gt;&gt; <span style="color: #483d8b;">type</span>(<span style="color: #483d8b;">type</span>(42))
&lt;<span style="color: #483d8b;">type</span> <span style="color: #8b2252;">'type'</span>&gt;
</pre>

</div>

</div>

<div id="outline-container-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> 测试值为false的对象</h4>
<div class="outline-text-4" id="text-1-3-2">

<ul>
<li>None False "" [] () {} 所有值为零的数
</li>
<li>如果是用户自己创建的类实例，如果nonzero(__nonzero__())或length(__len__())的值为零，其布尔值也是false
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 标准类型运算符</h3>
<div class="outline-text-3" id="text-1-4">


</div>

<div id="outline-container-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> 值比较</h4>
<div class="outline-text-4" id="text-1-4-1">

<p>== != &gt; &gt;= &lt; &lt;=
</p></div>

</div>

<div id="outline-container-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> 对象身份比较</h4>
<div class="outline-text-4" id="text-1-4-2">

<p>变量名是对象的引用，对象身份比较用于判断两个引用是否指向同一个对象。使用is和is not比较两个对象的身份。
</p>


<pre class="src src-python">&gt;&gt;&gt; <span style="color: #a0522d;">a</span> = 3
&gt;&gt;&gt; <span style="color: #a0522d;">b</span> = 3
&gt;&gt;&gt; a <span style="color: #a020f0;">is</span> b
<span style="color: #008b8b;">True</span>
&gt;&gt;&gt; <span style="color: #a0522d;">a</span> = 3.5
&gt;&gt;&gt; <span style="color: #a0522d;">b</span> = 3.5
&gt;&gt;&gt; a <span style="color: #a020f0;">is</span> b
<span style="color: #008b8b;">False</span>
&gt;&gt;&gt; <span style="color: #a0522d;">a</span> = 3.5
&gt;&gt;&gt; <span style="color: #a0522d;">b</span> = a
&gt;&gt;&gt; a <span style="color: #a020f0;">is</span> b
<span style="color: #008b8b;">True</span>
&gt;&gt;&gt; <span style="color: #a0522d;">a</span> = <span style="color: #a0522d;">b</span> = 3.5
&gt;&gt;&gt; a <span style="color: #a020f0;">is</span> b
<span style="color: #008b8b;">True</span>
</pre>

</div>

</div>

<div id="outline-container-1-4-3" class="outline-4">
<h4 id="sec-1-4-3"><span class="section-number-4">1.4.3</span> 逻辑运算符</h4>
<div class="outline-text-4" id="text-1-4-3">

<ul>
<li>and
</li>
<li>or
</li>
<li>not
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> 标准类型的内建函数</h3>
<div class="outline-text-3" id="text-1-5">

<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">函数</th><th scope="col" class="left">功能</th></tr>
</thead>
<tbody>
<tr><td class="left">cmp(obj1, obj2)</td><td class="left">比较obj1和obj2的值，返回大于零(obj1&gt;obj2)、小于零(obj1&lt;obj2)、等于零(obj1==obj2)的整数</td></tr>
<tr><td class="left">repr(obj)</td><td class="left">返回一个对象的字符串表示</td></tr>
<tr><td class="left">str(obj)</td><td class="left">返回一个对象可读性好的字符串表示</td></tr>
<tr><td class="left">type(obj)</td><td class="left">得到一个对象的类型</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> 类型工厂函数</h3>
<div class="outline-text-3" id="text-1-6">

<p>python2.2统一了类型和类，所有的内建类型现在也都是类。
原来的内建转换函数像int()、str()现在都成了工厂函数。
它们看上去有点像函数，实际上它们是类。
</p></div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> 标准类型的分类</h3>
<div class="outline-text-3" id="text-1-7">

<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">数据类型</th><th scope="col" class="left">存储模型</th><th scope="col" class="left">更新模型</th><th scope="col" class="left">访问模型</th></tr>
</thead>
<tbody>
<tr><td class="left">数字</td><td class="left">Scalar</td><td class="left">不可更改</td><td class="left">直接访问</td></tr>
<tr><td class="left">字符串</td><td class="left">Scalar</td><td class="left">不可更改</td><td class="left">顺序访问</td></tr>
<tr><td class="left">列表</td><td class="left">Container</td><td class="left">可更改</td><td class="left">顺序访问</td></tr>
<tr><td class="left">元组</td><td class="left">Container</td><td class="left">不可更改</td><td class="left">顺序访问</td></tr>
<tr><td class="left">字典</td><td class="left">Container</td><td class="left">可更改</td><td class="left">映射访问</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> 不支持的类型</h3>
<div class="outline-text-3" id="text-1-8">

<ul>
<li>char
</li>
<li>byte
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 数字</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 整形</h3>
<div class="outline-text-3" id="text-2-1">

<ul>
<li>布尔型
</li>
<li>标准整形 八进制以0开始，十六进制以0x开始
</li>
<li>长整形 以L结尾
</li>
</ul>

<p>标准整形超出范围会自动转化为长整形
</p>


<pre class="src src-python">&gt;&gt;&gt; 9999 ** 8
99920027994400699944002799920001L
</pre>

</div>

</div>
