src/python核心编程.org
*** 混合模式
#+BEGIN_SRC python
if 有一个操作数是复数：
    另一个操作数被转换为复数
elif 有一个操作数是浮点数：
    另一个操作数被转换为浮点数
elif 有一个操作数是长整数：
    另一个操作数被转换为长整数
else
    两者必然都是不同整数，无需转换
#+END_SRC
*** 算数运算符
+ 传统除法
#+BEGIN_SRC python
>>> 1/2
0
>>> 1.0/2.0
0.5
#+END_SRC
+ 真正的除法
#+BEGIN_SRC python
>>> from __future__ import division
>>> 1/2
0.5
>>> 1.0/2.0
0.5
#+END_SRC
+ 地板除
#+BEGIN_SRC python
>>> 1 // 2
0
>>> 1.0 // 2.0
0.0
#+END_SRC
#+ATTR_HTML: border="2" rules="all" frame="border"
| 表达式         | 结果                                 |
|----------------+--------------------------------------|
| +expr          | 结果符号不变                         |
| -expr          | 对结果符号取负                       |
|----------------+--------------------------------------|
| expr1 * expr2  | 表达式1 乘 表达式2                   |
| expr1 / expr2  | 表达式1 除以 表达式2(传统除或真正除) |
| expr1 // expr2 | 表达式1 地板除以 表达式2             |
| expr1 % expr2  | 表达式1 对表达式2 取余               |
| expr1 + expr2  | 表达式1 加 表达式2                   |
| expr1 - expr2  | 表达式1 减 表达式2                   |
** 用于数字类型的内建函数
#+ATTR_HTML: border="2" rules="all" frame="border"
| 函数                     | 功能                                                                                 |
|--------------------------+--------------------------------------------------------------------------------------|
| abs(num)　　　　　　　　 | 返回num的绝对值                                                                      |
| coerce(num1, num2) 　　  | 将num1和num2转换为同一类型,然后以一个元组的形式返回。                                |
| divmod(num1, num2) 　　  | 除法-取余运算的结合。返回一个元组(num1/num2,num1%num2)。                             |
| pow(num1, num2, mod=1)   | 取num1的num2次方,如果提供mod参数,则计算结果再对mod进行取余运算                       |
| round(flt, ndig=0) 　　  | 接受一个浮点数flt并对其四舍五入,保存ndig位小数。若不提供ndig参数,则默认小数点后0位。 |
** 仅用于整数的函数
#+ATTR_HTML: border="2" rules="all" frame="border"
| 函数　　     | 　　操作                                                                                          |
|--------------+---------------------------------------------------------------------------------------------------|
| hex(num) 　  | 将数字转换成十六进制数并以字符串形式返回                                                          |
| oct(num) 　  | 将数字转换成八进制数并以字符串形式返回                                                            |
| chr(num) 　  | 将ASCII值的数字转换成ASCII字符,范围只能是0 <= num <= 255。                                        |
| ord(chr)　　 | 接受一个ASCII或Unicode字符(长度为1的字符串),返回相应的ASCII或Unicode值。                          |
| unichr(num)  | 接受Unicode码值,返回其对应的Unicode字符。所接受的码值范围依赖于你的Python是构建于UCS‐2还是UCS‐4。 |
** bool
用户自己定义的对象，若无__onozero__()默认值是True
#+BEGIN_SRC python
>>> class C: pass
... 
>>> c = C()
>>> bool(c)
True

>>> class C:
...     def __nonzero__(self):
...             return False
... 
>>> c = C()
>>> bool(c)
False
#+END_SRC
* 序列：字符串、列表和元组
** 序列类型操作符
#+ATTR_HTML: border="2" rules="all" frame="border"
| 序列操作符　　　  | 作用                                 |
|-------------------+--------------------------------------|
| seq[ind]　　　　  | 获得下标为 ind 的元素                |
| seq[ind1:ind2]　  | 获得下标从 ind1 到 ind2 间的元素集合 |
| seq * expr　　　  | 序列重复 expr 次                     |
| seq1 + seq2　　　 | 连接序列 seq1 和 seq2                |
| obj in seq　　　  | 判断 obj 元素是否包含在 seq 中       |
| obj not in seq　  | 判断 obj 元素是否不包含在 seq 中     |
** 序列类型转换工厂函数
#+ATTR_HTML: border="2" rules="all" frame="border"
| 函数         | 含义                                                                                                 |
|--------------+------------------------------------------------------------------------------------------------------|
| list(iter)   | 把可迭代对象转换为列表                                                                               |
| tuple(iter)  | 把一个可迭代对象转换成一个元组对象                                                                                                     |
| str(obj)     | 把 obj 对象转换成字符串(对象的字符串表示法)                                                          |
| unicode(obj) | 把对象转换成 Unicode 字符串(使用默认编码)                                                            |
| basestring() | 抽象工厂函数,其作用仅仅是为 str 和 unicode 函数提供父类,所以不能被实例化,也不能被调用(详见第 6.2 节) |
** 序列类型可用的内置函数
#+ATTR_HTML: border="2" rules="all" frame="border"
| 函数名                                              | 功能                                                                                                                                |
|-----------------------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------|
| enumerate(iter)                                     | 接受一个可迭代对象作为参数,返回一个 enumerate 对象(同时也是一个迭代器),该对象生成由 iter 每个元素的 index 值和 item 值组成的元组    |
| len(seq)                                            | 返回 seq 的长度                                                                                                                     |
| max(iter,key=None) or max(arg0,arg1...,key=None)    | 返回 iter 或(arg0,arg1,...)中的最大值,如果指定了 key,这个key必须是一个可以传给 sort()方法的,用于比较的回调函数.                     |
| min(iter, key=None) or min(arg0, arg1.... key=None) | 返回iter里面的最小值;或者返回(arg0,arg2,...)里面的最小值;如果指定了 key,这个 key 必须是一个可以传给sort()方法的,用于比较的回调函数. |
| reversed(seq)                                       | 接受一个序列作为参数,返回一个以逆序访问的迭代器                                                                                     |
| sorted(iter,func=None,key=None,reverse=False)       | 接受一个可迭代对象作为参数,返回一个有序的列表;可选参数func,key 和 reverse 的含义跟 list.sort()内建函数的参数含义一样.               |
| sum(seq, init=0)                                    | 返回seq和可选参数init的总和,其效果等同于reduce(operator.add,seq,init)                                                               |
| zip([it0, it1,... itN])                             | 返回一个列表,其第一个元素是 it0,it1,...这些元素的第一个元素组成的一个元组,第二个...,类推.                                           |
