html/python核心编程.html

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 双精度浮点数</h3>
<div class="outline-text-3" id="text-2-2">

</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 复数</h3>
<div class="outline-text-3" id="text-2-3">

<p>复数的内建属性
</p><ul>
<li>real 实部
</li>
<li>imag 虚部
</li>
<li>conjugate() 共轭
</li>
</ul>




<pre class="src src-python">&gt;&gt;&gt; <span style="color: #a0522d;">a</span> = 3+5j
&gt;&gt;&gt; a.real
3.0
&gt;&gt;&gt; a.imag
5.0
&gt;&gt;&gt; a.conjugate()
(3-5j)
</pre>

</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 运算符</h3>
<div class="outline-text-3" id="text-2-4">


</div>

<div id="outline-container-2-4-1" class="outline-4">
<h4 id="sec-2-4-1"><span class="section-number-4">2.4.1</span> 混合模式</h4>
<div class="outline-text-4" id="text-2-4-1">




<pre class="src src-python"><span style="color: #a020f0;">if</span> &#26377;&#19968;&#20010;&#25805;&#20316;&#25968;&#26159;&#22797;&#25968;&#65306;
    &#21478;&#19968;&#20010;&#25805;&#20316;&#25968;&#34987;&#36716;&#25442;&#20026;&#22797;&#25968;
<span style="color: #a020f0;">elif</span> &#26377;&#19968;&#20010;&#25805;&#20316;&#25968;&#26159;&#28014;&#28857;&#25968;&#65306;
    &#21478;&#19968;&#20010;&#25805;&#20316;&#25968;&#34987;&#36716;&#25442;&#20026;&#28014;&#28857;&#25968;
<span style="color: #a020f0;">elif</span> &#26377;&#19968;&#20010;&#25805;&#20316;&#25968;&#26159;&#38271;&#25972;&#25968;&#65306;
    &#21478;&#19968;&#20010;&#25805;&#20316;&#25968;&#34987;&#36716;&#25442;&#20026;&#38271;&#25972;&#25968;
<span style="color: #a020f0;">else</span>
    &#20004;&#32773;&#24517;&#28982;&#37117;&#26159;&#19981;&#21516;&#25972;&#25968;&#65292;&#26080;&#38656;&#36716;&#25442;
</pre>

</div>

</div>

<div id="outline-container-2-4-2" class="outline-4">
<h4 id="sec-2-4-2"><span class="section-number-4">2.4.2</span> 算数运算符</h4>
<div class="outline-text-4" id="text-2-4-2">

<ul>
<li>传统除法
</li>
</ul>




<pre class="src src-python">&gt;&gt;&gt; 1/2
0
&gt;&gt;&gt; 1.0/2.0
0.5
</pre>

<ul>
<li>真正的除法
</li>
</ul>




<pre class="src src-python">&gt;&gt;&gt; <span style="color: #a020f0;">from</span> __future__ <span style="color: #a020f0;">import</span> division
&gt;&gt;&gt; 1/2
0.5
&gt;&gt;&gt; 1.0/2.0
0.5
</pre>

<ul>
<li>地板除
</li>
</ul>




<pre class="src src-python">&gt;&gt;&gt; 1 // 2
0
&gt;&gt;&gt; 1.0 // 2.0
0.0
</pre>

<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">表达式</th><th scope="col" class="left">结果</th></tr>
</thead>
<tbody>
<tr><td class="left">+expr</td><td class="left">结果符号不变</td></tr>
<tr><td class="left">-expr</td><td class="left">对结果符号取负</td></tr>
</tbody>
<tbody>
<tr><td class="left">expr1 * expr2</td><td class="left">表达式1 乘 表达式2</td></tr>
<tr><td class="left">expr1 / expr2</td><td class="left">表达式1 除以 表达式2(传统除或真正除)</td></tr>
<tr><td class="left">expr1 // expr2</td><td class="left">表达式1 地板除以 表达式2</td></tr>
<tr><td class="left">expr1 % expr2</td><td class="left">表达式1 对表达式2 取余</td></tr>
<tr><td class="left">expr1 + expr2</td><td class="left">表达式1 加 表达式2</td></tr>
<tr><td class="left">expr1 - expr2</td><td class="left">表达式1 减 表达式2</td></tr>
</tbody>
</table>

</div>
</div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 用于数字类型的内建函数</h3>
<div class="outline-text-3" id="text-2-5">

<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">函数</th><th scope="col" class="left">功能</th></tr>
</thead>
<tbody>
<tr><td class="left">abs(num)　　　　　　　　</td><td class="left">返回num的绝对值</td></tr>
<tr><td class="left">coerce(num1, num2) 　　</td><td class="left">将num1和num2转换为同一类型,然后以一个元组的形式返回。</td></tr>
<tr><td class="left">divmod(num1, num2) 　　</td><td class="left">除法-取余运算的结合。返回一个元组(num1/num2,num1%num2)。</td></tr>
<tr><td class="left">pow(num1, num2, mod=1)</td><td class="left">取num1的num2次方,如果提供mod参数,则计算结果再对mod进行取余运算</td></tr>
<tr><td class="left">round(flt, ndig=0) 　　</td><td class="left">接受一个浮点数flt并对其四舍五入,保存ndig位小数。若不提供ndig参数,则默认小数点后0位。</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> 仅用于整数的函数</h3>
<div class="outline-text-3" id="text-2-6">

<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">函数　　</th><th scope="col" class="left">　　操作</th></tr>
</thead>
<tbody>
<tr><td class="left">hex(num) 　</td><td class="left">将数字转换成十六进制数并以字符串形式返回</td></tr>
<tr><td class="left">oct(num) 　</td><td class="left">将数字转换成八进制数并以字符串形式返回</td></tr>
<tr><td class="left">chr(num) 　</td><td class="left">将ASCII值的数字转换成ASCII字符,范围只能是0 &lt;= num &lt;= 255。</td></tr>
<tr><td class="left">ord(chr)　　</td><td class="left">接受一个ASCII或Unicode字符(长度为1的字符串),返回相应的ASCII或Unicode值。</td></tr>
<tr><td class="left">unichr(num)</td><td class="left">接受Unicode码值,返回其对应的Unicode字符。所接受的码值范围依赖于你的Python是构建于UCS‐2还是UCS‐4。</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> bool</h3>
<div class="outline-text-3" id="text-2-7">

<p>用户自己定义的对象，若无__onozero__()默认值是True
</p>


<pre class="src src-python">&gt;&gt;&gt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">C</span>: <span style="color: #a020f0;">pass</span>
... 
&gt;&gt;&gt; <span style="color: #a0522d;">c</span> = C()
&gt;&gt;&gt; <span style="color: #483d8b;">bool</span>(c)
<span style="color: #008b8b;">True</span>

&gt;&gt;&gt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">C</span>:
...     <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">__nonzero__</span>(<span style="color: #a020f0;">self</span>):
...             <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">False</span>
... 
&gt;&gt;&gt; <span style="color: #a0522d;">c</span> = C()
&gt;&gt;&gt; <span style="color: #483d8b;">bool</span>(c)
<span style="color: #008b8b;">False</span>
</pre>

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 序列：字符串、列表和元组</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 序列类型操作符</h3>
<div class="outline-text-3" id="text-3-1">

<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">序列操作符　　　</th><th scope="col" class="left">作用</th></tr>
</thead>
<tbody>
<tr><td class="left">seq[ind]　　　　</td><td class="left">获得下标为 ind 的元素</td></tr>
<tr><td class="left">seq[ind1:ind2]　</td><td class="left">获得下标从 ind1 到 ind2 间的元素集合</td></tr>
<tr><td class="left">seq * expr　　　</td><td class="left">序列重复 expr 次</td></tr>
<tr><td class="left">seq1 + seq2　　　</td><td class="left">连接序列 seq1 和 seq2</td></tr>
<tr><td class="left">obj in seq　　　</td><td class="left">判断 obj 元素是否包含在 seq 中</td></tr>
<tr><td class="left">obj not in seq　</td><td class="left">判断 obj 元素是否不包含在 seq 中</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 序列类型转换工厂函数</h3>
<div class="outline-text-3" id="text-3-2">

<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">函数</th><th scope="col" class="left">含义</th></tr>
</thead>
<tbody>
<tr><td class="left">list(iter)</td><td class="left">把可迭代对象转换为列表</td></tr>
<tr><td class="left">tuple(iter)</td><td class="left">把一个可迭代对象转换成一个元组对象</td></tr>
<tr><td class="left">str(obj)</td><td class="left">把 obj 对象转换成字符串(对象的字符串表示法)</td></tr>
<tr><td class="left">unicode(obj)</td><td class="left">把对象转换成 Unicode 字符串(使用默认编码)</td></tr>
<tr><td class="left">basestring()</td><td class="left">抽象工厂函数,其作用仅仅是为 str 和 unicode 函数提供父类,所以不能被实例化,也不能被调用(详见第 6.2 节)</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 序列类型可用的内置函数</h3>
<div class="outline-text-3" id="text-3-3">

<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">函数名</th><th scope="col" class="left">功能</th></tr>
</thead>
<tbody>
<tr><td class="left">enumerate(iter)</td><td class="left">接受一个可迭代对象作为参数,返回一个 enumerate 对象(同时也是一个迭代器),该对象生成由 iter 每个元素的 index 值和 item 值组成的元组</td></tr>
<tr><td class="left">len(seq)</td><td class="left">返回 seq 的长度</td></tr>
<tr><td class="left">max(iter,key=None) or max(arg0,arg1&hellip;,key=None)</td><td class="left">返回 iter 或(arg0,arg1,&hellip;)中的最大值,如果指定了 key,这个key必须是一个可以传给 sort()方法的,用于比较的回调函数.</td></tr>
<tr><td class="left">min(iter, key=None) or min(arg0, arg1&hellip;. key=None)</td><td class="left">返回iter里面的最小值;或者返回(arg0,arg2,&hellip;)里面的最小值;如果指定了 key,这个 key 必须是一个可以传给sort()方法的,用于比较的回调函数.</td></tr>
<tr><td class="left">reversed(seq)</td><td class="left">接受一个序列作为参数,返回一个以逆序访问的迭代器</td></tr>
<tr><td class="left">sorted(iter,func=None,key=None,reverse=False)</td><td class="left">接受一个可迭代对象作为参数,返回一个有序的列表;可选参数func,key 和 reverse 的含义跟 list.sort()内建函数的参数含义一样.</td></tr>
<tr><td class="left">sum(seq, init=0)</td><td class="left">返回seq和可选参数init的总和,其效果等同于reduce(operator.add,seq,init)</td></tr>
<tr><td class="left">zip([it0, it1,&hellip; itN])</td><td class="left">返回一个列表,其第一个元素是 it0,it1,&hellip;这些元素的第一个元素组成的一个元组,第二个&hellip;,类推.</td></tr>
</tbody>
</table>

</div>

</div>
