src/python核心编程.org
** 字符串
+ Python 里面单引号和双引号的作用是相同的，这一点Python不同于其他类Shell的脚本语言。
+ 符串是不可变类型,就是说改变一个字符串的元素需要新建一个新的字符串。
+ Python实际上有3类字符串.通常意义的字符串(str)和Unicode字符串(unicode)实际上都是抽象类basestring的子类。basestring是不能实例化的。
+ 除了使用加号连接字符串，还可以编译时连接字符串
#+BEGIN_SRC python
>>> s = "hello " 'world'
>>> s
'hello world'
#+END_SRC
*** 只适用字符串的操作符
**** 格式化操作符%
字符串格式化符号
#+ATTR_HTML: border="2" rules="all" frame="border"
| 格式化字符 | 转换方式                                                             |
|------------+----------------------------------------------------------------------|
| %c         | 转换成字符(ASCII 码值,或者长度为一的字符串)                          |
| %r         | 优先用 repr()函数进行字符串转换                                      |
| %s         | 优先用 str()函数进行字符串转换                                       |
| %d / %i    | 转成有符号十进制数                                                   |
| %u         | 转成无符号十进制数                                                   |
| %o         | 转成无符号八进制数                                                   |
| %x / %X    | (Unsigned)转成无符号十六进制数(x/X 代表转换后的十六进制字符的大小写) |
| %e / %E    | 转成科学计数法(e/E 控制输出 e/E)                                     |
| %f / %F    | 转成浮点数(小数部分自然截断)                                         |
| %g / %G    | %e和%f / %E和%F 的简写                                               |
| %%         | 输出%                                                                     |
格式化辅助指令
#+ATTR_HTML: border="2" rules="all" frame="border"
| 符号  | 作用                                                                             |
|-------+----------------------------------------------------------------------------------|
| *     | 定义宽度或者小数点精度                                                           |
| -     | 用做左对齐                                                                       |
| +     | 在正数前面显示加号( + )                                                          |
| <sp>  | 在正数前面显示空格                                                               |
| #     | 在八进制数前面显示零('0'),在十六进制前面显示'0x'或者'0X'(取决于用的是'x'还是'X') |
| 0     | 显示的数字前面填充‘0’而不是默认的空格                                          |
| %     | '%%'输出一个单一的'%'                                                            |
| (var) | 映射变量(字典参数)                                                               |
| m.n   | m 是显示的最小总宽度,n 是小数点后的位数(如果可用的话)                                                                                 |
example
#+BEGIN_SRC python
>>> dic = {'a':'abc'}
>>> '%(a)s'%dic
'abc'
>>> '%.2f'%1234.56789
'1234.57'
#+END_SRC
**** 原始字符串操作符r
不对特殊或不能打印的字符进行转义
**** unicode字符串操作符u 
*** 字符串内建函数
#+BEGIN_SRC python
string.capitalize()
string.center(width)
string.count(str, beg=0,end=len(string))
string.decode(encoding='UTF-8',errors='strict')
string.encode(encoding='UTF-8',errors='strict')
string.endswith(obj, beg=0,end=len(string))
string.expandtabs(tabsize=8)
string.find(str, beg=0,end=len(string))
string.index(str, beg=0,end=len(string))
string.isalnum()
string.isalpha()
string.isdecimal()
string.isdigit()
string.islower()
string.isnumeric()
string.isspace()
string.istitle()
string.isupper()
string.join(seq)
string.ljust(width)
string.lower()
string.lstrip()
string.partition(str)
string.replace(str1, str2,num=string.count(str1))
string.rfind(str, beg=0,end=len(string))
string.rindex( str, beg=0,end=len(string))
string.rjust(width)
string.rpartition(str)
string.rstrip()
string.split(str="", num=string.count(str))
string.splitlines(num=string.count('\n'))
string.startswith(obj, beg=0,end=len(string))
string.strip([obj])
string.swapcase()
string.title()
string.translate(str, del="")
string.upper()
string.zfill(width)
#+END_SRC
*** unicode
使用unicode的原则
+ 程序中出现字符串时一定要加个前缀 u.
+ 不要用 str()函数,用 unicode()代替.
+ 不要用过时的 string 模块 -- 如果传给它的是非 ASCII 字符,它会把一切搞砸。
+ 不到必须时不要在你的程序里面编解码 unicode 字符.只在你要写入文件或数据库或者网络时,才调用 encode()函数;相应地,只在你需要把数据读回来的时候才调用 decode()函数.
** 列表
*** 列表的内建函数
#+BEGIN_SRC python
list.append(obj)
list.count(obj)
list.extend(seq)
list.index(obj, i=0,j=len(list))
list.insert(index, obj)
list.pop(index=-1)
list.remove(obj)
list.reverse()
list.sort(func=None,key=None,reverse=False)
#+END_SRC
** 元组
+ 组和列表相比有一个很重要的区别,元组是一种不可变类型。正因为这个原因,元组能做一些列表不能做的事情，如用做一个字典的 key。
+ 虽然元组是不可变的，但是元组中的可变对象的内容还是可以改变的，如
#+BEGIN_QUOTE
#+BEGIN_SRC python
>>> tup = ('a', 3, [5])
>>> tup
('a', 3, [5])
>>> tup[2][0] = 8
>>> tup
('a', 3, [8])
#+END_SRC
#+END_QUOTE
+ 所有多对象的、逗号分隔的、没有明确用符号(如方括号/圆括号)定义的集合默认都是元组类型。如
#+BEGIN_QUOTE
所有函数返回的多对象都是元组
#+BEGIN_SRC python
>>> 'a', 3, [5]
('a', 3, [5])
#+END_SRC
#+END_QUOTE
+ 只有一个元素的元组需要在元组分割符里面加一个逗号(,)用以防止跟普通的分组操作符混淆
+ 不可变对象的值是不可改变的，这就意味着它们通过 hash 算法得到的值总是一个值。因此元组可以作为自检的键，而列表不能。

