html/python核心编程.html

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> 字符串</h3>
<div class="outline-text-3" id="text-3-4">

<ul>
<li>Python 里面单引号和双引号的作用是相同的，这一点Python不同于其他类Shell的脚本语言。
</li>
<li>符串是不可变类型,就是说改变一个字符串的元素需要新建一个新的字符串。
</li>
<li>Python实际上有3类字符串.通常意义的字符串(str)和Unicode字符串(unicode)实际上都是抽象类basestring的子类。basestring是不能实例化的。
</li>
<li>除了使用加号连接字符串，还可以编译时连接字符串
</li>
</ul>




<pre class="src src-python">&gt;&gt;&gt; <span style="color: #a0522d;">s</span> = <span style="color: #8b2252;">"hello "</span> <span style="color: #8b2252;">'world'</span>
&gt;&gt;&gt; s
<span style="color: #8b2252;">'hello world'</span>
</pre>


</div>

<div id="outline-container-3-4-1" class="outline-4">
<h4 id="sec-3-4-1"><span class="section-number-4">3.4.1</span> 只适用字符串的操作符</h4>
<div class="outline-text-4" id="text-3-4-1">

<ul>
<li id="sec-3-4-1-1">格式化操作符%<br/>
字符串格式化符号
<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">格式化字符</th><th scope="col" class="left">转换方式</th></tr>
</thead>
<tbody>
<tr><td class="left">%c</td><td class="left">转换成字符(ASCII 码值,或者长度为一的字符串)</td></tr>
<tr><td class="left">%r</td><td class="left">优先用 repr()函数进行字符串转换</td></tr>
<tr><td class="left">%s</td><td class="left">优先用 str()函数进行字符串转换</td></tr>
<tr><td class="left">%d / %i</td><td class="left">转成有符号十进制数</td></tr>
<tr><td class="left">%u</td><td class="left">转成无符号十进制数</td></tr>
<tr><td class="left">%o</td><td class="left">转成无符号八进制数</td></tr>
<tr><td class="left">%x / %X</td><td class="left">(Unsigned)转成无符号十六进制数(x/X 代表转换后的十六进制字符的大小写)</td></tr>
<tr><td class="left">%e / %E</td><td class="left">转成科学计数法(e/E 控制输出 e/E)</td></tr>
<tr><td class="left">%f / %F</td><td class="left">转成浮点数(小数部分自然截断)</td></tr>
<tr><td class="left">%g / %G</td><td class="left">%e和%f / %E和%F 的简写</td></tr>
<tr><td class="left">%%</td><td class="left">输出%</td></tr>
</tbody>
</table>

格式化辅助指令
<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">符号</th><th scope="col" class="left">作用</th></tr>
</thead>
<tbody>
<tr><td class="left">*</td><td class="left">定义宽度或者小数点精度</td></tr>
<tr><td class="left">-</td><td class="left">用做左对齐</td></tr>
<tr><td class="left">+</td><td class="left">在正数前面显示加号( + )</td></tr>
<tr><td class="left">&lt;sp&gt;</td><td class="left">在正数前面显示空格</td></tr>
<tr><td class="left">#</td><td class="left">在八进制数前面显示零('0'),在十六进制前面显示'0x'或者'0X'(取决于用的是'x'还是'X')</td></tr>
<tr><td class="left">0</td><td class="left">显示的数字前面填充‘0’而不是默认的空格</td></tr>
<tr><td class="left">%</td><td class="left">'%%'输出一个单一的'%'</td></tr>
<tr><td class="left">(var)</td><td class="left">映射变量(字典参数)</td></tr>
<tr><td class="left">m.n</td><td class="left">m 是显示的最小总宽度,n 是小数点后的位数(如果可用的话)</td></tr>
</tbody>
</table>

example



<pre class="src src-python">&gt;&gt;&gt; <span style="color: #a0522d;">dic</span> = {<span style="color: #8b2252;">'a'</span>:<span style="color: #8b2252;">'abc'</span>}
&gt;&gt;&gt; <span style="color: #8b2252;">'%(a)s'</span>%dic
<span style="color: #8b2252;">'abc'</span>
&gt;&gt;&gt; <span style="color: #8b2252;">'%.2f'</span>%1234.56789
<span style="color: #8b2252;">'1234.57'</span>
</pre>

</li>
</ul>
<ul>
<li id="sec-3-4-1-2">原始字符串操作符r<br/>
不对特殊或不能打印的字符进行转义
</li>
</ul>
<ul>
<li id="sec-3-4-1-3">unicode字符串操作符u<br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-3-4-2" class="outline-4">
<h4 id="sec-3-4-2"><span class="section-number-4">3.4.2</span> 字符串内建函数</h4>
<div class="outline-text-4" id="text-3-4-2">




<pre class="src src-python">string.capitalize()
string.center(width)
string.count(<span style="color: #483d8b;">str</span>, beg=0,end=<span style="color: #483d8b;">len</span>(string))
string.decode(encoding=<span style="color: #8b2252;">'UTF-8'</span>,errors=<span style="color: #8b2252;">'strict'</span>)
string.encode(encoding=<span style="color: #8b2252;">'UTF-8'</span>,errors=<span style="color: #8b2252;">'strict'</span>)
string.endswith(obj, beg=0,end=<span style="color: #483d8b;">len</span>(string))
string.expandtabs(tabsize=8)
string.find(<span style="color: #483d8b;">str</span>, beg=0,end=<span style="color: #483d8b;">len</span>(string))
string.index(<span style="color: #483d8b;">str</span>, beg=0,end=<span style="color: #483d8b;">len</span>(string))
string.isalnum()
string.isalpha()
string.isdecimal()
string.isdigit()
string.islower()
string.isnumeric()
string.isspace()
string.istitle()
string.isupper()
string.join(seq)
string.ljust(width)
string.lower()
string.lstrip()
string.partition(<span style="color: #483d8b;">str</span>)
string.replace(str1, str2,num=string.count(str1))
string.rfind(<span style="color: #483d8b;">str</span>, beg=0,end=<span style="color: #483d8b;">len</span>(string))
string.rindex( <span style="color: #483d8b;">str</span>, beg=0,end=<span style="color: #483d8b;">len</span>(string))
string.rjust(width)
string.rpartition(<span style="color: #483d8b;">str</span>)
string.rstrip()
string.split(<span style="color: #483d8b;">str</span>=<span style="color: #8b2252;">""</span>, num=string.count(<span style="color: #483d8b;">str</span>))
string.splitlines(num=string.count(<span style="color: #8b2252;">'\n'</span>))
string.startswith(obj, beg=0,end=<span style="color: #483d8b;">len</span>(string))
string.strip([obj])
string.swapcase()
string.title()
string.translate(<span style="color: #483d8b;">str</span>, <span style="color: #a020f0;">del</span>=<span style="color: #8b2252;">""</span>)
string.upper()
string.zfill(width)
</pre>

</div>

</div>

<div id="outline-container-3-4-3" class="outline-4">
<h4 id="sec-3-4-3"><span class="section-number-4">3.4.3</span> unicode</h4>
<div class="outline-text-4" id="text-3-4-3">

<p>使用unicode的原则
</p><ul>
<li>程序中出现字符串时一定要加个前缀 u.
</li>
<li>不要用 str()函数,用 unicode()代替.
</li>
<li>不要用过时的 string 模块 &ndash; 如果传给它的是非 ASCII 字符,它会把一切搞砸。
</li>
<li>不到必须时不要在你的程序里面编解码 unicode 字符.只在你要写入文件或数据库或者网络时,才调用 encode()函数;相应地,只在你需要把数据读回来的时候才调用 decode()函数.
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> 列表</h3>
<div class="outline-text-3" id="text-3-5">


</div>

<div id="outline-container-3-5-1" class="outline-4">
<h4 id="sec-3-5-1"><span class="section-number-4">3.5.1</span> 列表的内建函数</h4>
<div class="outline-text-4" id="text-3-5-1">




<pre class="src src-python"><span style="color: #483d8b;">list</span>.append(obj)
<span style="color: #483d8b;">list</span>.count(obj)
<span style="color: #483d8b;">list</span>.extend(seq)
<span style="color: #483d8b;">list</span>.index(obj, i=0,j=<span style="color: #483d8b;">len</span>(<span style="color: #483d8b;">list</span>))
<span style="color: #483d8b;">list</span>.insert(index, obj)
<span style="color: #483d8b;">list</span>.pop(index=-1)
<span style="color: #483d8b;">list</span>.remove(obj)
<span style="color: #483d8b;">list</span>.reverse()
<span style="color: #483d8b;">list</span>.sort(func=<span style="color: #008b8b;">None</span>,key=<span style="color: #008b8b;">None</span>,reverse=<span style="color: #008b8b;">False</span>)
</pre>

</div>
</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> 元组</h3>
<div class="outline-text-3" id="text-3-6">

<ul>
<li>组和列表相比有一个很重要的区别,元组是一种不可变类型。正因为这个原因,元组能做一些列表不能做的事情，如用做一个字典的 key。
</li>
<li>虽然元组是不可变的，但是元组中的可变对象的内容还是可以改变的，如
</li>
</ul>

<blockquote>




<pre class="src src-python">&gt;&gt;&gt; <span style="color: #a0522d;">tup</span> = (<span style="color: #8b2252;">'a'</span>, 3, [5])
&gt;&gt;&gt; tup
(<span style="color: #8b2252;">'a'</span>, 3, [5])
&gt;&gt;&gt; tup[2][0] = 8
&gt;&gt;&gt; tup
(<span style="color: #8b2252;">'a'</span>, 3, [8])
</pre>


</blockquote>


<ul>
<li>所有多对象的、逗号分隔的、没有明确用符号(如方括号/圆括号)定义的集合默认都是元组类型。如
</li>
</ul>

<blockquote>

<p>所有函数返回的多对象都是元组
</p>


<pre class="src src-python">&gt;&gt;&gt; <span style="color: #8b2252;">'a'</span>, 3, [5]
(<span style="color: #8b2252;">'a'</span>, 3, [5])
</pre>


</blockquote>


<ul>
<li>只有一个元素的元组需要在元组分割符里面加一个逗号(,)用以防止跟普通的分组操作符混淆
</li>
<li>不可变对象的值是不可改变的，这就意味着它们通过 hash 算法得到的值总是一个值。因此元组可以作为自检的键，而列表不能。
</li>
</ul>


</div>

</div>
