src/python核心编程.org
** 浅拷贝和深拷贝
+ 序列类型对象的默认拷贝类型是浅拷贝,并可以以下几种方式实施
  1. 完全切片操作[:]
  2. 利用工厂函数,比如 list(),dict()等
  3. 使用 copy 模块的 copy 函数
+ 序列拷贝时，对于不可变类型的元素会创建一个新的对象，而对于可变类型的元素只是复制了其引用
#+BEGIN_QUOTE
#+BEGIN_SRC python
>>> lst = ['name',[1]]
>>> lst1 = lst[:]               #完全切片操作，浅拷贝
>>> lst2 = list(lst)            #利用工厂函数，浅拷贝
>>> lst1[0] = 'wch'             #对于不可变类型的元素
>>> lst1,lst2
(['wch', [1]], ['name', [1]])
>>> lst1[1][0] = 7              #对于可变类型的元素
>>> lst1,lst2
(['wch', [7]], ['name', [7]])
#+END_SRC
#+END_QUOTE
+ 要得到一个完全拷贝或者说深拷贝，需要 copy.deepcopy()函数
#+BEGIN_QUOTE
#+BEGIN_SRC python
>>> import copy
>>> lst = ['name',[1]]
>>> lst1 = copy.deepcopy(lst)   #深拷贝
>>> lst2 = copy.deepcopy(lst)   #深拷贝
>>> lst1[0] = 'wch'             #对于不可变类型的元素
>>> lst1,lst2
(['wch', [1]], ['name', [1]])
>>> lst1[1][0] = 7              #对于可变类型的元素
>>> lst1,lst2
(['wch', [7]], ['name', [1]])
#+END_SRC
#+END_QUOTE
* 映射和集合类型
** 字典
+ 字典是 Python 语言中唯一的映射类型
+ 映射类型中的数据是无序排列的
*** 创建字典
#+BEGIN_SRC python
+ dic = {'x':1, 'y':2}
+ dic = dict((['x', 1], ['y', 2]))
+ dic = {}.fromkeys(('x', 'y'), -1)
#+END_SRC
*** 访问字典中的值
+ 使用[key]访问字典中的值
+ 如果字典中没有对应的键，将产生KeyError错误
*** 字典的键
+ 不允许一个键对应多个值，当有键发生冲突时，取最近的赋值
+ 键必须是可哈希的
+ 所有不可变类型都可以做键
+ 实现了__hash__()的可变类型也可以做键
+ 对于数字，值相等的数字表示相同的键，1和1.0的哈希值是相同的，它们是相同的键
** 映射类型相关函数
*** dict()
+ 如果不提供参数，生成空字典
+ 如果参数是可以迭代的，可迭代的元素必须包含两个子元素，第一个子元素做key，第二个子元素做value
+ 如果参数是另一个映射对象，将生成该对象的浅拷贝。在这种情况下，更快的方法是使用dic.copy()方法
*** 映射类型的内建方法
#+BEGIN_SRC python
dict.clear ()
dict.copy ()
dict.fromkeys (seq,val=None)
dict.get(key,default=None)
dict.has_key(key)
dict.items()
dict.keys()
dict.iterkeys()
dict.itervalues()
dict.iteritems()
dict.popc(key[, default])
dict.setdefault(key,default=None)
dict.update(dict2)
dict.values()
#+END_SRC
** 集合
集合有两种不同的类型
+ 可变集合(set)
  + 可以添加和删除元素
  + 不是可哈希的
+ 不可变集合(frozenset)
  + 不可以添加和删除元素
  + 可哈希
*** 创建集合
创建集合的唯一方法是用工厂方法set()和frozenset()
** 集合类型的内建方法
适用于所有集合的方法
#+ATTR_HTML: border="2" rules="all" frame="border"
| 方法                      | 操作符  |
|---------------------------+---------|
| s.issubset(t)             | < <= in |
| s.issuperset(t)           | > >=    |
| s.union(t)                | 竖线    |
| s.intersection(t)         | &       |
| s.difference(t)           | -       |
| s.symmetric_difference(t) | ^       |
| s.copy()                  |         |
只适用于可变集合的方法
#+BEGIN_SRC python
+ s.update(t)
+ s.intersection_update(t)
+ s.difference_update(t)
+ s.symmetric_difference_update(t)
+ s.add(obj)
+ s.remove(obj)
+ s.discard(obj)
+ s.pop()
+ s.clear()
#+END_SRC
* 条件和循环
** 条件和循环拾遗
+ 如果一个复合语句(if,while,for)的代码块仅仅包含一行代码，那么它可以和前面的语句写在同一行上。但是不推荐这样做。
#+BEGIN_QUOTE
#+BEGIN_SRC python
if cond : func()
#+END_SRC
#+END_QUOTE
+ python里没有switch/case语句，但完全可以用其他python结构替代它
  + if elif elif ... else
  + if xxx in ('a','b','c') ... else: ...
  + 可以把可能的case和相应的值定义在字典中
#+BEGIN_QUOTE
#+BEGIN_SRC python
msgs = {'create': 'create item',
        'delete': 'delete item',
        'update': 'update item'}
default = 'invalid choice... try again!'
action = msgs.get(user.cmd, default)
#+END_SRC
#+END_QUOTE
+ python中没有三元操作符:?，其替代品是
#+BEGIN_QUOTE
#+BEGIN_SRC python
x if c else y
如
smaller = x if x<y else y
#+END_SRC
#+END_QUOTE
+ for循环既可以访问序列，也可以访问迭代器。for循环访问迭代器和访问序列的方法差不多，唯一的区别是for语句会为迭代器做一些额外的事，如调用next()方法和捕获StopIteration异常
+ while和for后也可以跟else语句，else子句只在循环完成后执行，也就是说break语句也会跳过else块
** 迭代器
迭代器为那些功能上和序列相似的对象提供了接口，
使得你可以迭代不是序列但表现出序列行为的对象
*** 如何迭代
+ 迭代器就是有一个 next() 方法的对象，当你或是一个循环机制(例如 for 语句)需要下一个项时, 调用迭代器的 next() 方法就可以获得它
+ 条目全部取出后, 会引发一个 StopIteration 异常, 这并不表示错误发生, 只是告诉外部调用者, 迭代完成
+ 迭代器也有一些限制. 例如你不能向后移动, 不能回到开始, 也不能复制一个迭代器
+ 除了序列之外，字典和文件是另外两个可迭代的python数据类型
  + 字典的迭代会遍历它的key (for key in dic)
  + 文件对象生成的迭代器会自动调用readline()方法 (for line in fin)
+ 在迭代可变对象时不要修改对象
*** 创建迭代器
+ iter(obj) obj可以是序列，也可以是实现了__iter__()和next()方法的类
+ iter(func, sentinel) 会重复地执行func，直到迭代器的下个值等于sentinel
