html/python核心编程.html

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> 浅拷贝和深拷贝</h3>
<div class="outline-text-3" id="text-3-7">

<ul>
<li>序列类型对象的默认拷贝类型是浅拷贝,并可以以下几种方式实施
<ol>
<li>完全切片操作[:]
</li>
<li>利用工厂函数,比如 list(),dict()等
</li>
<li>使用 copy 模块的 copy 函数
</li>
</ol>

</li>
<li>序列拷贝时，对于不可变类型的元素会创建一个新的对象，而对于可变类型的元素只是复制了其引用
</li>
</ul>

<blockquote>




<pre class="src src-python">&gt;&gt;&gt; <span style="color: #a0522d;">lst</span> = [<span style="color: #8b2252;">'name'</span>,[1]]
&gt;&gt;&gt; <span style="color: #a0522d;">lst1</span> = lst[:]               <span style="color: #b22222;">#</span><span style="color: #b22222;">&#23436;&#20840;&#20999;&#29255;&#25805;&#20316;&#65292;&#27973;&#25335;&#36125;</span>
&gt;&gt;&gt; <span style="color: #a0522d;">lst2</span> = <span style="color: #483d8b;">list</span>(lst)            <span style="color: #b22222;">#</span><span style="color: #b22222;">&#21033;&#29992;&#24037;&#21378;&#20989;&#25968;&#65292;&#27973;&#25335;&#36125;</span>
&gt;&gt;&gt; <span style="color: #a0522d;">lst1</span>[0] = <span style="color: #8b2252;">'wch'</span>             <span style="color: #b22222;">#</span><span style="color: #b22222;">&#23545;&#20110;&#19981;&#21487;&#21464;&#31867;&#22411;&#30340;&#20803;&#32032;</span>
&gt;&gt;&gt; lst1,lst2
([<span style="color: #8b2252;">'wch'</span>, [1]], [<span style="color: #8b2252;">'name'</span>, [1]])
&gt;&gt;&gt; lst1[1][0] = 7              <span style="color: #b22222;">#</span><span style="color: #b22222;">&#23545;&#20110;&#21487;&#21464;&#31867;&#22411;&#30340;&#20803;&#32032;</span>
&gt;&gt;&gt; lst1,lst2
([<span style="color: #8b2252;">'wch'</span>, [7]], [<span style="color: #8b2252;">'name'</span>, [7]])
</pre>


</blockquote>


<ul>
<li>要得到一个完全拷贝或者说深拷贝，需要 copy.deepcopy()函数
</li>
</ul>

<blockquote>




<pre class="src src-python">&gt;&gt;&gt; <span style="color: #a020f0;">import</span> copy
&gt;&gt;&gt; <span style="color: #a0522d;">lst</span> = [<span style="color: #8b2252;">'name'</span>,[1]]
&gt;&gt;&gt; <span style="color: #a0522d;">lst1</span> = copy.deepcopy(lst)   <span style="color: #b22222;">#</span><span style="color: #b22222;">&#28145;&#25335;&#36125;</span>
&gt;&gt;&gt; <span style="color: #a0522d;">lst2</span> = copy.deepcopy(lst)   <span style="color: #b22222;">#</span><span style="color: #b22222;">&#28145;&#25335;&#36125;</span>
&gt;&gt;&gt; <span style="color: #a0522d;">lst1</span>[0] = <span style="color: #8b2252;">'wch'</span>             <span style="color: #b22222;">#</span><span style="color: #b22222;">&#23545;&#20110;&#19981;&#21487;&#21464;&#31867;&#22411;&#30340;&#20803;&#32032;</span>
&gt;&gt;&gt; lst1,lst2
([<span style="color: #8b2252;">'wch'</span>, [1]], [<span style="color: #8b2252;">'name'</span>, [1]])
&gt;&gt;&gt; lst1[1][0] = 7              <span style="color: #b22222;">#</span><span style="color: #b22222;">&#23545;&#20110;&#21487;&#21464;&#31867;&#22411;&#30340;&#20803;&#32032;</span>
&gt;&gt;&gt; lst1,lst2
([<span style="color: #8b2252;">'wch'</span>, [7]], [<span style="color: #8b2252;">'name'</span>, [1]])
</pre>


</blockquote>


</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 映射和集合类型</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 字典</h3>
<div class="outline-text-3" id="text-4-1">

<ul>
<li>字典是 Python 语言中唯一的映射类型
</li>
<li>映射类型中的数据是无序排列的
</li>
</ul>


</div>

<div id="outline-container-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> 创建字典</h4>
<div class="outline-text-4" id="text-4-1-1">




<pre class="src src-python">+ <span style="color: #a0522d;">dic</span> = {<span style="color: #8b2252;">'x'</span>:1, <span style="color: #8b2252;">'y'</span>:2}
+ <span style="color: #a0522d;">dic</span> = <span style="color: #483d8b;">dict</span>(([<span style="color: #8b2252;">'x'</span>, 1], [<span style="color: #8b2252;">'y'</span>, 2]))
+ <span style="color: #a0522d;">dic</span> = {}.fromkeys((<span style="color: #8b2252;">'x'</span>, <span style="color: #8b2252;">'y'</span>), -1)
</pre>

</div>

</div>

<div id="outline-container-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> 访问字典中的值</h4>
<div class="outline-text-4" id="text-4-1-2">

<ul>
<li>使用[key]访问字典中的值
</li>
<li>如果字典中没有对应的键，将产生KeyError错误
</li>
</ul>

</div>

</div>

<div id="outline-container-4-1-3" class="outline-4">
<h4 id="sec-4-1-3"><span class="section-number-4">4.1.3</span> 字典的键</h4>
<div class="outline-text-4" id="text-4-1-3">

<ul>
<li>不允许一个键对应多个值，当有键发生冲突时，取最近的赋值
</li>
<li>键必须是可哈希的
</li>
<li>所有不可变类型都可以做键
</li>
<li>实现了__hash__()的可变类型也可以做键
</li>
<li>对于数字，值相等的数字表示相同的键，1和1.0的哈希值是相同的，它们是相同的键
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 映射类型相关函数</h3>
<div class="outline-text-3" id="text-4-2">


</div>

<div id="outline-container-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> dict()</h4>
<div class="outline-text-4" id="text-4-2-1">

<ul>
<li>如果不提供参数，生成空字典
</li>
<li>如果参数是可以迭代的，可迭代的元素必须包含两个子元素，第一个子元素做key，第二个子元素做value
</li>
<li>如果参数是另一个映射对象，将生成该对象的浅拷贝。在这种情况下，更快的方法是使用dic.copy()方法
</li>
</ul>

</div>

</div>

<div id="outline-container-4-2-2" class="outline-4">
<h4 id="sec-4-2-2"><span class="section-number-4">4.2.2</span> 映射类型的内建方法</h4>
<div class="outline-text-4" id="text-4-2-2">




<pre class="src src-python"><span style="color: #483d8b;">dict</span>.clear ()
<span style="color: #483d8b;">dict</span>.copy ()
<span style="color: #483d8b;">dict</span>.fromkeys (seq,val=<span style="color: #008b8b;">None</span>)
<span style="color: #483d8b;">dict</span>.get(key,default=<span style="color: #008b8b;">None</span>)
<span style="color: #483d8b;">dict</span>.has_key(key)
<span style="color: #483d8b;">dict</span>.items()
<span style="color: #483d8b;">dict</span>.keys()
<span style="color: #483d8b;">dict</span>.iterkeys()
<span style="color: #483d8b;">dict</span>.itervalues()
<span style="color: #483d8b;">dict</span>.iteritems()
<span style="color: #483d8b;">dict</span>.popc(key[, default])
<span style="color: #483d8b;">dict</span>.setdefault(key,default=<span style="color: #008b8b;">None</span>)
<span style="color: #483d8b;">dict</span>.update(dict2)
<span style="color: #483d8b;">dict</span>.values()
</pre>

</div>
</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 集合</h3>
<div class="outline-text-3" id="text-4-3">

<p>集合有两种不同的类型
</p><ul>
<li>可变集合(set)
<ul>
<li>可以添加和删除元素
</li>
<li>不是可哈希的
</li>
</ul>

</li>
<li>不可变集合(frozenset)
<ul>
<li>不可以添加和删除元素
</li>
<li>可哈希
</li>
</ul>

</li>
</ul>


</div>

<div id="outline-container-4-3-1" class="outline-4">
<h4 id="sec-4-3-1"><span class="section-number-4">4.3.1</span> 创建集合</h4>
<div class="outline-text-4" id="text-4-3-1">

<p>创建集合的唯一方法是用工厂方法set()和frozenset()
</p></div>
</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> 集合类型的内建方法</h3>
<div class="outline-text-3" id="text-4-4">

<p>适用于所有集合的方法
</p><table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">方法</th><th scope="col" class="left">操作符</th></tr>
</thead>
<tbody>
<tr><td class="left">s.issubset(t)</td><td class="left">&lt; &lt;= in</td></tr>
<tr><td class="left">s.issuperset(t)</td><td class="left">&gt; &gt;=</td></tr>
<tr><td class="left">s.union(t)</td><td class="left">竖线</td></tr>
<tr><td class="left">s.intersection(t)</td><td class="left">&amp;</td></tr>
<tr><td class="left">s.difference(t)</td><td class="left">-</td></tr>
<tr><td class="left">s.symmetric_difference(t)</td><td class="left">^</td></tr>
<tr><td class="left">s.copy()</td><td class="left"></td></tr>
</tbody>
</table>

只适用于可变集合的方法



<pre class="src src-python">+ s.update(t)
+ s.intersection_update(t)
+ s.difference_update(t)
+ s.symmetric_difference_update(t)
+ s.add(obj)
+ s.remove(obj)
+ s.discard(obj)
+ s.pop()
+ s.clear()
</pre>

</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 条件和循环</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 条件和循环拾遗</h3>
<div class="outline-text-3" id="text-5-1">

<ul>
<li>如果一个复合语句(if,while,for)的代码块仅仅包含一行代码，那么它可以和前面的语句写在同一行上。但是不推荐这样做。
</li>
</ul>

<blockquote>




<pre class="src src-python"><span style="color: #a020f0;">if</span> cond : func()
</pre>


</blockquote>


<ul>
<li>python里没有switch/case语句，但完全可以用其他python结构替代它
<ul>
<li>if elif elif &hellip; else
</li>
<li>if xxx in ('a','b','c') &hellip; else: &hellip;
</li>
<li>可以把可能的case和相应的值定义在字典中
</li>
</ul>

</li>
</ul>

<blockquote>




<pre class="src src-python"><span style="color: #a0522d;">msgs</span> = {<span style="color: #8b2252;">'create'</span>: <span style="color: #8b2252;">'create item'</span>,
        <span style="color: #8b2252;">'delete'</span>: <span style="color: #8b2252;">'delete item'</span>,
        <span style="color: #8b2252;">'update'</span>: <span style="color: #8b2252;">'update item'</span>}
<span style="color: #a0522d;">default</span> = <span style="color: #8b2252;">'invalid choice... try again!'</span>
<span style="color: #a0522d;">action</span> = msgs.get(user.cmd, default)
</pre>


</blockquote>


<ul>
<li>python中没有三元操作符:?，其替代品是
</li>
</ul>

<blockquote>




<pre class="src src-python">x <span style="color: #a020f0;">if</span> c <span style="color: #a020f0;">else</span> y
&#22914;
<span style="color: #a0522d;">smaller</span> = x <span style="color: #a020f0;">if</span> x&lt;y <span style="color: #a020f0;">else</span> y
</pre>


</blockquote>


<ul>
<li>for循环既可以访问序列，也可以访问迭代器。for循环访问迭代器和访问序列的方法差不多，唯一的区别是for语句会为迭代器做一些额外的事，如调用next()方法和捕获StopIteration异常
</li>
<li>while和for后也可以跟else语句，else子句只在循环完成后执行，也就是说break语句也会跳过else块
</li>
</ul>

</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> 迭代器</h3>
<div class="outline-text-3" id="text-5-2">

<p>迭代器为那些功能上和序列相似的对象提供了接口，
使得你可以迭代不是序列但表现出序列行为的对象
</p>
</div>

<div id="outline-container-5-2-1" class="outline-4">
<h4 id="sec-5-2-1"><span class="section-number-4">5.2.1</span> 如何迭代</h4>
<div class="outline-text-4" id="text-5-2-1">

<ul>
<li>迭代器就是有一个 next() 方法的对象，当你或是一个循环机制(例如 for 语句)需要下一个项时, 调用迭代器的 next() 方法就可以获得它
</li>
<li>条目全部取出后, 会引发一个 StopIteration 异常, 这并不表示错误发生, 只是告诉外部调用者, 迭代完成
</li>
<li>迭代器也有一些限制. 例如你不能向后移动, 不能回到开始, 也不能复制一个迭代器
</li>
<li>除了序列之外，字典和文件是另外两个可迭代的python数据类型
<ul>
<li>字典的迭代会遍历它的key (for key in dic)
</li>
<li>文件对象生成的迭代器会自动调用readline()方法 (for line in fin)
</li>
</ul>

</li>
<li>在迭代可变对象时不要修改对象
</li>
</ul>

</div>

</div>

<div id="outline-container-5-2-2" class="outline-4">
<h4 id="sec-5-2-2"><span class="section-number-4">5.2.2</span> 创建迭代器</h4>
<div class="outline-text-4" id="text-5-2-2">

<ul>
<li>iter(obj) obj可以是序列，也可以是实现了__iter__()和next()方法的类
</li>
<li>iter(func, sentinel) 会重复地执行func，直到迭代器的下个值等于sentinel
</li>
</ul>

</div>
</div>

</div>
