src/python核心编程.org
** 列表解析
#+BEGIN_SRC python
[expr for iter_var in iterable]
[expr for iter_var in iterable if cond_expr] #条件过滤
[expr for iter_var in iterable for iter_var2 in iterable2] #双重循环
#+END_SRC
** 生成器
生成器与列表解析非常相似，语法基本相同，
不过它不真正创建数字列表，而是返回一个生成器，
每次计算出一个条目后，yield这个条目，并暂停代码的执行。
#+BEGIN_SRC python
(expr for iter_var in iterable if cond_expr)
#+END_SRC

* 文件和输入输出
** 文件内建函数open()和file()
#+BEGIN_SRC python
file_object = open(file_name, access_mode='r', buffering=-1)
#+END_SRC
file()和open()具有相同的功能，可以任意替换。它们返回的是文件对象。
*** 文件对象的访问模式
#+ATTR_HTML: border="2" rules="all" frame="border"
| 文件模式 | 操作                                           |
| r        | 以读方式打开                                   |
| rU 或 Ua | 以读方式打开, 同时提供通用换行符支持 (PEP 278) |
| w        | 以写方式打开 (必要时清空)                      |
| a        | 以追加模式打开 (从 EOF 开始, 必要时创建新文件) |
| r+       | 以读写模式打开                                 |
| w+       | 以读写模式打开 (参见 w )                       |
| a+       | 以读写模式打开 (参见 a )                       |
| rb       | 以二进制读模式打开                             |
| wb       | 以二进制写模式打开 (参见 w )                   |
| ab       | 以二进制追加模式打开 (参见 a )                 |
| rb+      | 以二进制读写模式打开 (参见 r+ )                |
| wb+      | 以二进制读写模式打开 (参见 w+ )                |
| ab+      | 以二进制读写模式打开 (参见 a+ )                |
*** 缓冲方式
buffering用于指示访问文件所采用的缓冲方式
+ 0表示不缓冲
+ 1表示只缓冲一行数据
+ 任何其它大于 1 的值代表使用给定值作为缓冲区大小
+ 不提供该参数或者给定负值代表使用系统默认缓冲机制
  + 对任何类电报机( tty )设备使用行缓冲
  + 其它设备使用正常缓冲
+ 一般情况下使用系统默认方式即可.
*** 通用换行符支持
不同平台用来表示行结束的符号是不同的, 例如\n,\r,或者\r\n，
当你使用'U'标志打开文件的时候, 所有的行分割符通过Python的输入方法(例如read*())返回时都会被替换为换行符NEWLINE(\n)
在编译 Python 的时候,UNS 默认是打开的
** 文件内建方法
#+ATTR_HTML: border="2" rules="all" frame="border"
| 文件对象的方法                  | 操作                                                                                                                                                                                                                                             |
|---------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| file.close()                    | 关闭文件                                                                                                                                                                                                                                         |
| file.fileno()                   | 返回文件的描述符(file descriptor ,FD, 整数值)                                                                                                                                                                                                    |
| file.flush()                    | 刷新文件的内部缓冲区                                                                                                                                                                                                                             |
| file.isatty()                   | 判断 file 是否是一个类 tty 设备                                                                                                                                                                                                                  |
| file.next()                     | 返回文件的下一行(类似于 file.readline() ), 或在没有其它行时引发 StopIteration 异常                                                                                                                                                               |
| file.read(size=-1)              | 从文件读取 size 个字节, 当未给定 size 或给定负值的时候, 读取剩余的所有字节, 然后作为字符串返回                                                                                                                                                   |
| file.readinto (buf, size)       | 从文件读取 size 个字节到 buf 缓冲器(已不支持)                                                                                                                                                                                                    |
| file.readline(size=-1)          | 从文件中读取并返回一行(包括行结束符), 或返回最大 size个字符                                                                                                                                                                                      |
| file.readlines(sizhint=0)       | 读取文件的所有行并作为一个列表返回(包含所有的行结束符); 如果给定 sizhint 且大于 0 , 那么将返回总和大约为sizhint 字节的行(大小由缓冲器容量的下一个值决定)(比如说缓冲器的大小只能为 4K 的倍数,如果 sizhint 为 15k,则最后返回的可能是 16k———译者按) |
| file.xreadlines ()              | 用于迭代, 可以替换 readlines() 的一个更高效的方法                                                                                                                                                                                                |
| file.seek(off, whence=0)        | 在文件中移动文件指针, 从 whence ( 0 代表文件起始, 1 代表当前位置, 2 代表文件末尾)偏移 off 字节                                                                                                                                                   |
| file.tell()                     | 返回当前在文件中的位置                                                                                                                                                                                                                           |
| file.truncate(size=file.tell()) | 截取文件到最大 size 字节, 默认为当前文件位置                                                                                                                                                                                                     |
| file.write(str)                 | 向文件写入字符串                                                                                                                                                                                                                                 |
| file.writelines(seq)            | 向文件写入字符串序列 seq ; seq 应该是一个返回字符串的可迭代对象; 在 2.2 前, 它只是字符串的列表                                                                                                                                                   |

** 文件内建属性
#+ATTR_HTML: border="2" rules="all" frame="border"
| 文件对象的属性 | 描述                                                                                                                                         |
|----------------+----------------------------------------------------------------------------------------------------------------------------------------------|
| file.closed    | True 表示文件已经被关闭, 否则为 False                                                                                                        |
| file.encoding  | 文件所使用的编码 - 当 Unicode 字符串被写入数据时, 它们将自动使用 file.encoding 转换为字节字符串; 若 file.encoding 为 None 时使用系统默认编码 |
| file.mode      | 文件打开时使用的访问模式                                                                                                                     |
| file.name      | 文件名                                                                                                                                       |
| file.newlines  | 未读取到行分隔符时为 None , 只有一种行分隔符时为一个字符串, 当文件有多种类型的行结束符时,则为一个包含所有当前所遇到的行结束符的列表          |

** 文件系统
