html/python核心编程.html

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> 列表解析</h3>
<div class="outline-text-3" id="text-5-3">




<pre class="src src-python">[expr <span style="color: #a020f0;">for</span> iter_var <span style="color: #a020f0;">in</span> iterable]
[expr <span style="color: #a020f0;">for</span> iter_var <span style="color: #a020f0;">in</span> iterable <span style="color: #a020f0;">if</span> cond_expr] <span style="color: #b22222;">#</span><span style="color: #b22222;">&#26465;&#20214;&#36807;&#28388;</span>
[expr <span style="color: #a020f0;">for</span> iter_var <span style="color: #a020f0;">in</span> iterable <span style="color: #a020f0;">for</span> iter_var2 <span style="color: #a020f0;">in</span> iterable2] <span style="color: #b22222;">#</span><span style="color: #b22222;">&#21452;&#37325;&#24490;&#29615;</span>
</pre>

</div>

</div>

<div id="outline-container-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> 生成器</h3>
<div class="outline-text-3" id="text-5-4">

<p>生成器与列表解析非常相似，语法基本相同，
不过它不真正创建数字列表，而是返回一个生成器，
每次计算出一个条目后，yield这个条目，并暂停代码的执行。
</p>


<pre class="src src-python">(expr <span style="color: #a020f0;">for</span> iter_var <span style="color: #a020f0;">in</span> iterable <span style="color: #a020f0;">if</span> cond_expr)
</pre>


</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 文件和输入输出</h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> 文件内建函数open()和file()</h3>
<div class="outline-text-3" id="text-6-1">




<pre class="src src-python"><span style="color: #a0522d;">file_object</span> = <span style="color: #483d8b;">open</span>(file_name, access_mode=<span style="color: #8b2252;">'r'</span>, buffering=-1)
</pre>

<p>
file()和open()具有相同的功能，可以任意替换。它们返回的是文件对象。
</p>
</div>

<div id="outline-container-6-1-1" class="outline-4">
<h4 id="sec-6-1-1"><span class="section-number-4">6.1.1</span> 文件对象的访问模式</h4>
<div class="outline-text-4" id="text-6-1-1">

<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">文件模式</td><td class="left">操作</td></tr>
<tr><td class="left">r</td><td class="left">以读方式打开</td></tr>
<tr><td class="left">rU 或 Ua</td><td class="left">以读方式打开, 同时提供通用换行符支持 (PEP 278)</td></tr>
<tr><td class="left">w</td><td class="left">以写方式打开 (必要时清空)</td></tr>
<tr><td class="left">a</td><td class="left">以追加模式打开 (从 EOF 开始, 必要时创建新文件)</td></tr>
<tr><td class="left">r+</td><td class="left">以读写模式打开</td></tr>
<tr><td class="left">w+</td><td class="left">以读写模式打开 (参见 w )</td></tr>
<tr><td class="left">a+</td><td class="left">以读写模式打开 (参见 a )</td></tr>
<tr><td class="left">rb</td><td class="left">以二进制读模式打开</td></tr>
<tr><td class="left">wb</td><td class="left">以二进制写模式打开 (参见 w )</td></tr>
<tr><td class="left">ab</td><td class="left">以二进制追加模式打开 (参见 a )</td></tr>
<tr><td class="left">rb+</td><td class="left">以二进制读写模式打开 (参见 r+ )</td></tr>
<tr><td class="left">wb+</td><td class="left">以二进制读写模式打开 (参见 w+ )</td></tr>
<tr><td class="left">ab+</td><td class="left">以二进制读写模式打开 (参见 a+ )</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-6-1-2" class="outline-4">
<h4 id="sec-6-1-2"><span class="section-number-4">6.1.2</span> 缓冲方式</h4>
<div class="outline-text-4" id="text-6-1-2">

<p>buffering用于指示访问文件所采用的缓冲方式
</p><ul>
<li>0表示不缓冲
</li>
<li>1表示只缓冲一行数据
</li>
<li>任何其它大于 1 的值代表使用给定值作为缓冲区大小
</li>
<li>不提供该参数或者给定负值代表使用系统默认缓冲机制
<ul>
<li>对任何类电报机( tty )设备使用行缓冲
</li>
<li>其它设备使用正常缓冲
</li>
</ul>

</li>
<li>一般情况下使用系统默认方式即可.
</li>
</ul>

</div>

</div>

<div id="outline-container-6-1-3" class="outline-4">
<h4 id="sec-6-1-3"><span class="section-number-4">6.1.3</span> 通用换行符支持</h4>
<div class="outline-text-4" id="text-6-1-3">

<p>不同平台用来表示行结束的符号是不同的, 例如\n,\r,或者\r\n，
当你使用'U'标志打开文件的时候, 所有的行分割符通过Python的输入方法(例如read*())返回时都会被替换为换行符NEWLINE(\n)
在编译 Python 的时候,UNS 默认是打开的
</p></div>
</div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> 文件内建方法</h3>
<div class="outline-text-3" id="text-6-2">

<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">文件对象的方法</th><th scope="col" class="left">操作</th></tr>
</thead>
<tbody>
<tr><td class="left">file.close()</td><td class="left">关闭文件</td></tr>
<tr><td class="left">file.fileno()</td><td class="left">返回文件的描述符(file descriptor ,FD, 整数值)</td></tr>
<tr><td class="left">file.flush()</td><td class="left">刷新文件的内部缓冲区</td></tr>
<tr><td class="left">file.isatty()</td><td class="left">判断 file 是否是一个类 tty 设备</td></tr>
<tr><td class="left">file.next()</td><td class="left">返回文件的下一行(类似于 file.readline() ), 或在没有其它行时引发 StopIteration 异常</td></tr>
<tr><td class="left">file.read(size=-1)</td><td class="left">从文件读取 size 个字节, 当未给定 size 或给定负值的时候, 读取剩余的所有字节, 然后作为字符串返回</td></tr>
<tr><td class="left">file.readinto (buf, size)</td><td class="left">从文件读取 size 个字节到 buf 缓冲器(已不支持)</td></tr>
<tr><td class="left">file.readline(size=-1)</td><td class="left">从文件中读取并返回一行(包括行结束符), 或返回最大 size个字符</td></tr>
<tr><td class="left">file.readlines(sizhint=0)</td><td class="left">读取文件的所有行并作为一个列表返回(包含所有的行结束符); 如果给定 sizhint 且大于 0 , 那么将返回总和大约为sizhint 字节的行(大小由缓冲器容量的下一个值决定)(比如说缓冲器的大小只能为 4K 的倍数,如果 sizhint 为 15k,则最后返回的可能是 16k———译者按)</td></tr>
<tr><td class="left">file.xreadlines ()</td><td class="left">用于迭代, 可以替换 readlines() 的一个更高效的方法</td></tr>
<tr><td class="left">file.seek(off, whence=0)</td><td class="left">在文件中移动文件指针, 从 whence ( 0 代表文件起始, 1 代表当前位置, 2 代表文件末尾)偏移 off 字节</td></tr>
<tr><td class="left">file.tell()</td><td class="left">返回当前在文件中的位置</td></tr>
<tr><td class="left">file.truncate(size=file.tell())</td><td class="left">截取文件到最大 size 字节, 默认为当前文件位置</td></tr>
<tr><td class="left">file.write(str)</td><td class="left">向文件写入字符串</td></tr>
<tr><td class="left">file.writelines(seq)</td><td class="left">向文件写入字符串序列 seq ; seq 应该是一个返回字符串的可迭代对象; 在 2.2 前, 它只是字符串的列表</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> 文件内建属性</h3>
<div class="outline-text-3" id="text-6-3">

<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">文件对象的属性</th><th scope="col" class="left">描述</th></tr>
</thead>
<tbody>
<tr><td class="left">file.closed</td><td class="left">True 表示文件已经被关闭, 否则为 False</td></tr>
<tr><td class="left">file.encoding</td><td class="left">文件所使用的编码 - 当 Unicode 字符串被写入数据时, 它们将自动使用 file.encoding 转换为字节字符串; 若 file.encoding 为 None 时使用系统默认编码</td></tr>
<tr><td class="left">file.mode</td><td class="left">文件打开时使用的访问模式</td></tr>
<tr><td class="left">file.name</td><td class="left">文件名</td></tr>
<tr><td class="left">file.newlines</td><td class="left">未读取到行分隔符时为 None , 只有一种行分隔符时为一个字符串, 当文件有多种类型的行结束符时,则为一个包含所有当前所遇到的行结束符的列表</td></tr>
</tbody>
</table>


</div>

</div>
