src/python核心编程.org
*** os.path
#+ATTR_HTML: border="2" rules="all" frame="border"
| 函数         | 描述                                |
|--------------+-------------------------------------|
| basename()   | 去掉目录路径, 返回文件名            |
| dirname()    | 去掉文件名, 返回目录路径            |
| join()       | 将分离的各部分组合成一个路径名      |
| split()      | 返回 (dirname(), basename()) 元组   |
| splitdrive() | 返回 (drivename, pathname) 元组     |
| splitext()   | 返回 (filename, extension) 元组信息 |
|--------------+-------------------------------------|
| getatime()   | 返回最近访问时间                    |
| getctime()   | 返回文件创建时间                    |
| getmtime()   | 返回最近文件修改时间                |
| getsize()    | 返回文件大小(以字节为单位)          |
|--------------+-------------------------------------|
| exists()     | 指定路径(文件或目录)是否存在        |
| isabs()      | 指定路径是否为绝对路径              |
| isdir()      | 指定路径是否存在且为一个目录        |
| isfile()     | 指定路径是否存在且为一个文件        |
| islink()     | 指定路径是否存在且为一个符号链接    |
| ismount()    | 指定路径是否存在且为一个挂载点      |
| samefile()   | 两个路径名是否指向同个文件          |

*** os
#+ATTR_HTML: border="2" rules="all" frame="border"
| 函数                 | 描述                                                       |
|----------------------+------------------------------------------------------------|
| mkfifo()/mknod()     | 创建命名管道/创建文件系统节点                              |
| remove()/unlink()    | Delete file 删除文件                                       |
| rename()/renames()   | 重命名文件                                                 |
| stat ()              | 返回文件信息                                               |
| symlink()            | 创建符号链接                                               |
| utime()              | 更新时间戳                                                 |
| tmpfile()            | 创建并打开('w+b')一个新的临时文件                          |
| walk()               | 生成一个目录树下的所有文件名                               |
|----------------------+------------------------------------------------------------|
| chdir()/fchdir()     | 改变当前工作目录/通过一个文件描述符改变当前工作目录        |
| chroot()             | 改变当前进程的根目录                                       |
| listdir()            | 列出指定目录的文件                                         |
| getcwd()/getcwdu()   | 返回当前工作目录/功能相同, 但返回一个 Unicode 对象         |
| mkdir()/makedirs()   | 创建目录/创建多层目录                                      |
| rmdir()/removedirs() | 删除目录/删除多层目录                                      |
|----------------------+------------------------------------------------------------|
| access()             | 检验权限模式                                               |
| chmod()              | 改变权限模式                                               |
| chown()/lchown()     | 改变 owner 和 group ID/功能相同, 但不会跟踪链接            |
|----------------------+------------------------------------------------------------|
| umask()              | 设置默认权限模式                                           |
| open()               | 底层的操作系统 open (对于文件, 使用标准的内建 open() 函数) |
| read()/write()       | 根据文件描述符读取/写入数据                                |
| dup()/dup2()         | 复制文件描述符号/功能相同, 但是是复制到另一个文件描述符    |
|----------------------+------------------------------------------------------------|
| makedev()            | 从 major 和 minor 设备号创建一个原始设备号                 |
| major()/minor()      | 从原始设备号获得 major/minor 设备号                        |
* 错误和异常
** 检测和处理异常
#+BEGIN_SRC python
try:
    try_suite     #监控这里的异常
except Exception[, reason]:
    except_suite  #异常处理代码
#+END_SRC
+ 在程序运行时, 解释器尝试执行try块里的所有代码, 如果代码块完成后没有异常发生, 执行流就会忽略except语句继续执行。
+ 一旦一个异常被引发, 剩余代码将被忽略, 解释器将逐级向上搜索处理器, 一旦找到,就开始执行处理器中的代码。
+ 如果到达最顶层仍然没有找到对应处理器, 那么就认为这个异常是未处理的, Python 解释器会显示出跟踪返回消息, 然后退出
+ reason是一个包含诊断信息的Exception类的实例，可以通过str(reason)打印错误原因
*** 带有多个except的try语句
#+BEGIN_SRC python
ry:
    try_suite
except Exception1[, reason1]:
    suite_for_exception_Exception1
except Exception2[, reason2]:
    suite_for_exception_Exception2
#+END_SRC
+ 同样, 首先尝试执行 try 子句, 如果没有错误, 忽略所有的 except 从句继续执行. 如果发生异常, 解释器将在这一串处理器(except 子句)中查找匹配的异常. 如果找到对应的处理器,执行流将跳转到这里
*** 处理多个异常的except语句
#+BEGIN_SRC python
except (Exc1[, Exc2[, ... ExcN]])[, reason]:
    suite_for_exceptions_Exc1_to_ExcN
#+END_SRC
+ except语句可以处理任意多个异常,它们被放入一个元组里
*** 捕获所有异常
#+BEGIN_SRC python
try:
    ...
except Exception, e:
    ...
#+END_SRC
+ 一个不正确的使用方法就是说把一大段程序放入一个 try 块中, 再用一个通用的 except 语句 "过滤"掉任何致命的错误, 忽略它们。
+ try-except的作用是提供一个可以提示错误或处理错误的机制, 而不是一个错误过滤器
*** else子句
#+BEGIN_SRC python
try:
    try_suite     #监控这里的异常
except Exception[, reason]:
    except_suite  #异常处理代码
else:
    ...
#+END_SRC
+ 在try范围中没有异常被检测到时，执行else子句
*** finally子句
+ finally 子句是无论异常是否发生,是否捕捉都会执行的一段代码
** with语句
#+BEGIN_SRC python
with context_expr [as var]:
    with_suite
例如：
with open('/etc/passwd', 'r') as f:
    for eachLine in f:
        ...
#+END_SRC
+ with会完成准备工作；发生异常时，会执行清理的代码；代码完成时，自动关闭文件；
+ with语句仅能工作于支持上下文管理协议的对象
+ 支持上下文管理协议的成员
   + file
   + decimal.Context
   + thread.LockType
   + threading.Lock
   + threading.RLock
   + threading.Condition
   + threading.Semaphore
   + threading.BoundedSemaphore
** 触发异常
#+BEGIN_SRC python
raise [SomeException [, args [, traceback]]]
#+END_SRC
+ 第一个参数,SomeExcpetion,是触发异常的名字.如果有,它必须是一个字符串,类或实例
+ 第二个符号为可选的args来传给异常，args是在异常时打印的信息，这可以是一个单独的对象也可以是一个对象的元组.当异常发生时,异常的参数总是作为一个元组传入
+ traceback,同样是可选的(实际上很少用它),如果有的话,则是当异常触发时新生成的追踪对象
