html/python核心编程.html

<div id="outline-container-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> 文件系统</h3>
<div class="outline-text-3" id="text-6-4">


</div>

<div id="outline-container-6-4-1" class="outline-4">
<h4 id="sec-6-4-1"><span class="section-number-4">6.4.1</span> os.path</h4>
<div class="outline-text-4" id="text-6-4-1">

<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">函数</th><th scope="col" class="left">描述</th></tr>
</thead>
<tbody>
<tr><td class="left">basename()</td><td class="left">去掉目录路径, 返回文件名</td></tr>
<tr><td class="left">dirname()</td><td class="left">去掉文件名, 返回目录路径</td></tr>
<tr><td class="left">join()</td><td class="left">将分离的各部分组合成一个路径名</td></tr>
<tr><td class="left">split()</td><td class="left">返回 (dirname(), basename()) 元组</td></tr>
<tr><td class="left">splitdrive()</td><td class="left">返回 (drivename, pathname) 元组</td></tr>
<tr><td class="left">splitext()</td><td class="left">返回 (filename, extension) 元组信息</td></tr>
</tbody>
<tbody>
<tr><td class="left">getatime()</td><td class="left">返回最近访问时间</td></tr>
<tr><td class="left">getctime()</td><td class="left">返回文件创建时间</td></tr>
<tr><td class="left">getmtime()</td><td class="left">返回最近文件修改时间</td></tr>
<tr><td class="left">getsize()</td><td class="left">返回文件大小(以字节为单位)</td></tr>
</tbody>
<tbody>
<tr><td class="left">exists()</td><td class="left">指定路径(文件或目录)是否存在</td></tr>
<tr><td class="left">isabs()</td><td class="left">指定路径是否为绝对路径</td></tr>
<tr><td class="left">isdir()</td><td class="left">指定路径是否存在且为一个目录</td></tr>
<tr><td class="left">isfile()</td><td class="left">指定路径是否存在且为一个文件</td></tr>
<tr><td class="left">islink()</td><td class="left">指定路径是否存在且为一个符号链接</td></tr>
<tr><td class="left">ismount()</td><td class="left">指定路径是否存在且为一个挂载点</td></tr>
<tr><td class="left">samefile()</td><td class="left">两个路径名是否指向同个文件</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-6-4-2" class="outline-4">
<h4 id="sec-6-4-2"><span class="section-number-4">6.4.2</span> os</h4>
<div class="outline-text-4" id="text-6-4-2">

<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">函数</th><th scope="col" class="left">描述</th></tr>
</thead>
<tbody>
<tr><td class="left">mkfifo()/mknod()</td><td class="left">创建命名管道/创建文件系统节点</td></tr>
<tr><td class="left">remove()/unlink()</td><td class="left">Delete file 删除文件</td></tr>
<tr><td class="left">rename()/renames()</td><td class="left">重命名文件</td></tr>
<tr><td class="left">stat ()</td><td class="left">返回文件信息</td></tr>
<tr><td class="left">symlink()</td><td class="left">创建符号链接</td></tr>
<tr><td class="left">utime()</td><td class="left">更新时间戳</td></tr>
<tr><td class="left">tmpfile()</td><td class="left">创建并打开('w+b')一个新的临时文件</td></tr>
<tr><td class="left">walk()</td><td class="left">生成一个目录树下的所有文件名</td></tr>
</tbody>
<tbody>
<tr><td class="left">chdir()/fchdir()</td><td class="left">改变当前工作目录/通过一个文件描述符改变当前工作目录</td></tr>
<tr><td class="left">chroot()</td><td class="left">改变当前进程的根目录</td></tr>
<tr><td class="left">listdir()</td><td class="left">列出指定目录的文件</td></tr>
<tr><td class="left">getcwd()/getcwdu()</td><td class="left">返回当前工作目录/功能相同, 但返回一个 Unicode 对象</td></tr>
<tr><td class="left">mkdir()/makedirs()</td><td class="left">创建目录/创建多层目录</td></tr>
<tr><td class="left">rmdir()/removedirs()</td><td class="left">删除目录/删除多层目录</td></tr>
</tbody>
<tbody>
<tr><td class="left">access()</td><td class="left">检验权限模式</td></tr>
<tr><td class="left">chmod()</td><td class="left">改变权限模式</td></tr>
<tr><td class="left">chown()/lchown()</td><td class="left">改变 owner 和 group ID/功能相同, 但不会跟踪链接</td></tr>
</tbody>
<tbody>
<tr><td class="left">umask()</td><td class="left">设置默认权限模式</td></tr>
<tr><td class="left">open()</td><td class="left">底层的操作系统 open (对于文件, 使用标准的内建 open() 函数)</td></tr>
<tr><td class="left">read()/write()</td><td class="left">根据文件描述符读取/写入数据</td></tr>
<tr><td class="left">dup()/dup2()</td><td class="left">复制文件描述符号/功能相同, 但是是复制到另一个文件描述符</td></tr>
</tbody>
<tbody>
<tr><td class="left">makedev()</td><td class="left">从 major 和 minor 设备号创建一个原始设备号</td></tr>
<tr><td class="left">major()/minor()</td><td class="left">从原始设备号获得 major/minor 设备号</td></tr>
</tbody>
</table>

</div>
</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 错误和异常</h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> 检测和处理异常</h3>
<div class="outline-text-3" id="text-7-1">




<pre class="src src-python"><span style="color: #a020f0;">try</span>:
    try_suite     <span style="color: #b22222;">#</span><span style="color: #b22222;">&#30417;&#25511;&#36825;&#37324;&#30340;&#24322;&#24120;</span>
<span style="color: #a020f0;">except</span> <span style="color: #228b22;">Exception</span>[, reason]:
    except_suite  <span style="color: #b22222;">#</span><span style="color: #b22222;">&#24322;&#24120;&#22788;&#29702;&#20195;&#30721;</span>
</pre>

<ul>
<li>在程序运行时, 解释器尝试执行try块里的所有代码, 如果代码块完成后没有异常发生, 执行流就会忽略except语句继续执行。
</li>
<li>一旦一个异常被引发, 剩余代码将被忽略, 解释器将逐级向上搜索处理器, 一旦找到,就开始执行处理器中的代码。
</li>
<li>如果到达最顶层仍然没有找到对应处理器, 那么就认为这个异常是未处理的, Python 解释器会显示出跟踪返回消息, 然后退出
</li>
<li>reason是一个包含诊断信息的Exception类的实例，可以通过str(reason)打印错误原因
</li>
</ul>


</div>

<div id="outline-container-7-1-1" class="outline-4">
<h4 id="sec-7-1-1"><span class="section-number-4">7.1.1</span> 带有多个except的try语句</h4>
<div class="outline-text-4" id="text-7-1-1">




<pre class="src src-python">ry:
    try_suite
<span style="color: #a020f0;">except</span> Exception1[, reason1]:
    suite_for_exception_Exception1
<span style="color: #a020f0;">except</span> Exception2[, reason2]:
    suite_for_exception_Exception2
</pre>

<ul>
<li>同样, 首先尝试执行 try 子句, 如果没有错误, 忽略所有的 except 从句继续执行. 如果发生异常, 解释器将在这一串处理器(except 子句)中查找匹配的异常. 如果找到对应的处理器,执行流将跳转到这里
</li>
</ul>

</div>

</div>

<div id="outline-container-7-1-2" class="outline-4">
<h4 id="sec-7-1-2"><span class="section-number-4">7.1.2</span> 处理多个异常的except语句</h4>
<div class="outline-text-4" id="text-7-1-2">




<pre class="src src-python"><span style="color: #a020f0;">except</span> (Exc1[, Exc2[, ... ExcN]])[, reason]:
    suite_for_exceptions_Exc1_to_ExcN
</pre>

<ul>
<li>except语句可以处理任意多个异常,它们被放入一个元组里
</li>
</ul>

</div>

</div>

<div id="outline-container-7-1-3" class="outline-4">
<h4 id="sec-7-1-3"><span class="section-number-4">7.1.3</span> 捕获所有异常</h4>
<div class="outline-text-4" id="text-7-1-3">




<pre class="src src-python"><span style="color: #a020f0;">try</span>:
    ...
<span style="color: #a020f0;">except</span> <span style="color: #228b22;">Exception</span>, e:
    ...
</pre>

<ul>
<li>一个不正确的使用方法就是说把一大段程序放入一个 try 块中, 再用一个通用的 except 语句 "过滤"掉任何致命的错误, 忽略它们。
</li>
<li>try-except的作用是提供一个可以提示错误或处理错误的机制, 而不是一个错误过滤器
</li>
</ul>

</div>

</div>

<div id="outline-container-7-1-4" class="outline-4">
<h4 id="sec-7-1-4"><span class="section-number-4">7.1.4</span> else子句</h4>
<div class="outline-text-4" id="text-7-1-4">




<pre class="src src-python"><span style="color: #a020f0;">try</span>:
    try_suite     <span style="color: #b22222;">#</span><span style="color: #b22222;">&#30417;&#25511;&#36825;&#37324;&#30340;&#24322;&#24120;</span>
<span style="color: #a020f0;">except</span> <span style="color: #228b22;">Exception</span>[, reason]:
    except_suite  <span style="color: #b22222;">#</span><span style="color: #b22222;">&#24322;&#24120;&#22788;&#29702;&#20195;&#30721;</span>
<span style="color: #a020f0;">else</span>:
    ...
</pre>

<ul>
<li>在try范围中没有异常被检测到时，执行else子句
</li>
</ul>

</div>

</div>

<div id="outline-container-7-1-5" class="outline-4">
<h4 id="sec-7-1-5"><span class="section-number-4">7.1.5</span> finally子句</h4>
<div class="outline-text-4" id="text-7-1-5">

<ul>
<li>finally 子句是无论异常是否发生,是否捕捉都会执行的一段代码
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> with语句</h3>
<div class="outline-text-3" id="text-7-2">




<pre class="src src-python"><span style="color: #a020f0;">with</span> context_expr [<span style="color: #a020f0;">as</span> var]:
    with_suite
&#20363;&#22914;&#65306;
<span style="color: #a020f0;">with</span> <span style="color: #483d8b;">open</span>(<span style="color: #8b2252;">'/etc/passwd'</span>, <span style="color: #8b2252;">'r'</span>) <span style="color: #a020f0;">as</span> f:
    <span style="color: #a020f0;">for</span> eachLine <span style="color: #a020f0;">in</span> f:
        ...
</pre>

<ul>
<li>with会完成准备工作；发生异常时，会执行清理的代码；代码完成时，自动关闭文件；
</li>
<li>with语句仅能工作于支持上下文管理协议的对象
</li>
<li>支持上下文管理协议的成员
<ul>
<li>file
</li>
<li>decimal.Context
</li>
<li>thread.LockType
</li>
<li>threading.Lock
</li>
<li>threading.RLock
</li>
<li>threading.Condition
</li>
<li>threading.Semaphore
</li>
<li>threading.BoundedSemaphore
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> 触发异常</h3>
<div class="outline-text-3" id="text-7-3">




<pre class="src src-python"><span style="color: #a020f0;">raise</span> [SomeException [, args [, traceback]]]
</pre>

<ul>
<li>第一个参数,SomeExcpetion,是触发异常的名字.如果有,它必须是一个字符串,类或实例
</li>
<li>第二个符号为可选的args来传给异常，args是在异常时打印的信息，这可以是一个单独的对象也可以是一个对象的元组.当异常发生时,异常的参数总是作为一个元组传入
</li>
<li>traceback,同样是可选的(实际上很少用它),如果有的话,则是当异常触发时新生成的追踪对象
</li>
</ul>


</div>
