src/python核心编程.org
*** raise常见用法
#+ATTR_HTML: border="2" rules="all" frame="border"
| raise 语法             | 描述                                               |
|------------------------+----------------------------------------------------|
| raise                  | 重新触发前一个异常,如果之前没有异常,触发 TypeError |
| raise string           | (过时的) 触发字符串异常                            |
| raise exclass          | 触发一个异常,从 exclass 生成一个实例               |
| raise exclass()        | 同上                                               |
|------------------------+----------------------------------------------------|
| raise string, args     | 提供异常参数 args,可以是一个参数也可以元组         |
| raise exclass, args    | 同上                                               |
| raise exclass(args)    | 同上                                               |
|------------------------+----------------------------------------------------|
| raise string, args, tb | 但提供一个追踪对象tb供使用                         |
| raise exclass,args, tb | 同上                                               |
** 断言
#+BEGIN_SRC python
assert expression[, arguments]
#+END_SRC
+ 断言语句等价于这样的 Python 表达式,如果断言成功不采取任何措施(类似语句),否则触发AssertionError(断言错误)的异常
** 标准异常
#+ATTR_HTML: border="2" rules="all" frame="border"
| BaseException             | 所有异常的基类                                     |
|---------------------------+----------------------------------------------------|
| SystemExit                | python解释器请求退出                               |
| KeyboardInterrupt         | 用户中断执行(通常是输入^C)                         |
| Exception                 | 常规错误的基类                                     |
| StopIteration             | 迭代器没有更多的值                                 |
| GeneratorExit             | 生成器(generator)发生异常来通知退出                |
| StandardError             | 所有的内建标准异常的基类                           |
| ArithmeticError           | 所有数值计算错误的基类                             |
| FloatingPointError        | 浮点计算错误                                       |
| OverflowError             | 数值运算超出最大限制                               |
| ZeroDivisionError         | 除(或取模)零 (所有数据类型)                        |
| AssertionError            | 断言语句失败                                       |
| AttributeError            | 对象没有这个属性                                   |
| EOFError                  | 没有内建输入,到达 EOF 标记                         |
| EnvironmentErrord         | 操作系统错误的基类                                 |
| IOError                   | 输入/输出操作失败                                  |
| OSError                   | 操作系统错误                                       |
| WindowsError              | Windows 系统调用失败                               |
| ImportError               | 导入模块/对象失败                                  |
| LookupError               | 无效数据查询的基类                                 |
| IndexError                | 序列中没有没有此索引(index)                        |
| KeyError                  | 映射中没有这个键                                   |
| MemoryError               | 内存溢出错误(对于 Python 解释器不是致命的)         |
| NameError                 | 未声明/初始化对象 (没有属性)                       |
| UnboundLocalErrorh        | 访问未初始化的本地变量                             |
| ReferenceError            | 弱引用(Weak reference)试图访问已经垃圾回收了的对象 |
| RuntimeError              | 一般的运行时错误                                   |
| NotImplementedErrord      | 尚未实现的方法                                     |
| SyntaxError               | Python语法错误                                     |
| IndentationError          | 缩进错误                                           |
| TabErrorg                 | Tab和空格混用                                      |
| SystemError               | 一般的解释器系统错误                               |
| TypeError                 | 对类型无效的操作                                   |
| ValueError                | 传入无效的参数                                     |
| UnicodeError              | Unicode 相关的错误                                 |
| UnicodeDecodeError        | Unicode 解码时的错误                               |
| UnicodeEncodeError        | Unicode 编码时错误                                 |
| UnicodeTranslateErrorf    | Unicode 转换时错误                                 |
| Warning                   | 警告的基类                                         |
| DeprecationWarning        | 关于被弃用的特征的警告                             |
| FutureWarning             | 关于构造将来语义会有改变的警告                     |
| OverflowWarning           | 旧的关于自动提升为长整型(long)的警告               |
| PendingDeprecationWarning | 关于特性将会被废弃的警告                           |
| RuntimeWarning            | 可疑的运行时行为(runtime behavior)的警告           |
| SyntaxWarning             | 可疑的语法的警告                                   |
| UserWarning               | 用户代码生成的警告                                 |
+ SystemExit,KeyboardInterrupt和Exception派生自BaseException
+ 其他素有内建异常都派生自Exception
* 函数和函数式编程
** 函数拾遗
+ 当没有显式地返回元素或者如果返回None时,python会返回一个None
+ 如果函数返回多个对象,python把他们聚集起来并以一个元组返回
+ 关键字参数的概念仅仅针对函数的调用。这种理念是让调用者通过函数调用中的参数名字来区分参数。这样规范允许参数缺失或者不按顺序,因为解释器能通过给出的关键字来匹配参数的值。
+ 默认参数就是声明了默认值的参数。因为给参数赋予了默认值,所以在函数调用时,不向该参数传入值也是允许的
+ Python 同样允许程序员执行一个没有显式定义参数的函数,相应的方法是通过一个把元组(非关键字参数)或字典(关键字参数)作为参数组传递给函数
  #+BEGIN_SRC python
  func(positional_args, 
       keyword_args,
       *tuple_grp_nonkw_args,
       **dict_grp_kw_args)
  #+END_SRC
+ Python 也不允许在函数未声明之前,对其进行引用或者调用
  #+BEGIN_SRC python
  #注意一种情况
  def foo():
      print 'in foo()'
      bar()
  def bar():
      print 'in bar()'
  foo()
  #这段代码是正确的因为即使对bar()进行的调用出现在 bar()的定义之前, 
  #但foo()本身不是在 bar()声明之前被调用的。
  #换句话说,我们声明 foo(),然后再声明 bar(),接着调用 foo(),
  #但是到那时,bar()已经存在了,所以调用成功
  #+END_SRC
+ 在函数体内创建另外一个函数对象是完全合法的。这种函数叫做内部/内嵌函数
+ 如果内部函数的定义包含了在外部函数里定义的对象的引用(这个对象甚至可以是在外部函数之外),内部函数会变成被称为闭包(closure)
+ 在python中，函数就像其他对象，是可以被引用的，可以作为参数传入函数,作为列表和字典等等容器对象的元素
  #+BEGIN_SRC python
  >>> def foo():
  ... print 'in foo()'
  ...
  >>> def bar(argfunc):
  ... argfunc()
  ...
  >>> bar(foo)
  in foo()
  #+END_SRC
** TODO 装饰器
