html/python核心编程.html

<div id="outline-container-7-3-1" class="outline-4">
<h4 id="sec-7-3-1"><span class="section-number-4">7.3.1</span> raise常见用法</h4>
<div class="outline-text-4" id="text-7-3-1">

<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">raise 语法</th><th scope="col" class="left">描述</th></tr>
</thead>
<tbody>
<tr><td class="left">raise</td><td class="left">重新触发前一个异常,如果之前没有异常,触发 TypeError</td></tr>
<tr><td class="left">raise string</td><td class="left">(过时的) 触发字符串异常</td></tr>
<tr><td class="left">raise exclass</td><td class="left">触发一个异常,从 exclass 生成一个实例</td></tr>
<tr><td class="left">raise exclass()</td><td class="left">同上</td></tr>
</tbody>
<tbody>
<tr><td class="left">raise string, args</td><td class="left">提供异常参数 args,可以是一个参数也可以元组</td></tr>
<tr><td class="left">raise exclass, args</td><td class="left">同上</td></tr>
<tr><td class="left">raise exclass(args)</td><td class="left">同上</td></tr>
</tbody>
<tbody>
<tr><td class="left">raise string, args, tb</td><td class="left">但提供一个追踪对象tb供使用</td></tr>
<tr><td class="left">raise exclass,args, tb</td><td class="left">同上</td></tr>
</tbody>
</table>

</div>
</div>

</div>

<div id="outline-container-7-4" class="outline-3">
<h3 id="sec-7-4"><span class="section-number-3">7.4</span> 断言</h3>
<div class="outline-text-3" id="text-7-4">




<pre class="src src-python"><span style="color: #a020f0;">assert</span> expression[, arguments]
</pre>

<ul>
<li>断言语句等价于这样的 Python 表达式,如果断言成功不采取任何措施(类似语句),否则触发AssertionError(断言错误)的异常
</li>
</ul>

</div>

</div>

<div id="outline-container-7-5" class="outline-3">
<h3 id="sec-7-5"><span class="section-number-3">7.5</span> 标准异常</h3>
<div class="outline-text-3" id="text-7-5">

<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">BaseException</th><th scope="col" class="left">所有异常的基类</th></tr>
</thead>
<tbody>
<tr><td class="left">SystemExit</td><td class="left">python解释器请求退出</td></tr>
<tr><td class="left">KeyboardInterrupt</td><td class="left">用户中断执行(通常是输入^C)</td></tr>
<tr><td class="left">Exception</td><td class="left">常规错误的基类</td></tr>
<tr><td class="left">StopIteration</td><td class="left">迭代器没有更多的值</td></tr>
<tr><td class="left">GeneratorExit</td><td class="left">生成器(generator)发生异常来通知退出</td></tr>
<tr><td class="left">StandardError</td><td class="left">所有的内建标准异常的基类</td></tr>
<tr><td class="left">ArithmeticError</td><td class="left">所有数值计算错误的基类</td></tr>
<tr><td class="left">FloatingPointError</td><td class="left">浮点计算错误</td></tr>
<tr><td class="left">OverflowError</td><td class="left">数值运算超出最大限制</td></tr>
<tr><td class="left">ZeroDivisionError</td><td class="left">除(或取模)零 (所有数据类型)</td></tr>
<tr><td class="left">AssertionError</td><td class="left">断言语句失败</td></tr>
<tr><td class="left">AttributeError</td><td class="left">对象没有这个属性</td></tr>
<tr><td class="left">EOFError</td><td class="left">没有内建输入,到达 EOF 标记</td></tr>
<tr><td class="left">EnvironmentErrord</td><td class="left">操作系统错误的基类</td></tr>
<tr><td class="left">IOError</td><td class="left">输入/输出操作失败</td></tr>
<tr><td class="left">OSError</td><td class="left">操作系统错误</td></tr>
<tr><td class="left">WindowsError</td><td class="left">Windows 系统调用失败</td></tr>
<tr><td class="left">ImportError</td><td class="left">导入模块/对象失败</td></tr>
<tr><td class="left">LookupError</td><td class="left">无效数据查询的基类</td></tr>
<tr><td class="left">IndexError</td><td class="left">序列中没有没有此索引(index)</td></tr>
<tr><td class="left">KeyError</td><td class="left">映射中没有这个键</td></tr>
<tr><td class="left">MemoryError</td><td class="left">内存溢出错误(对于 Python 解释器不是致命的)</td></tr>
<tr><td class="left">NameError</td><td class="left">未声明/初始化对象 (没有属性)</td></tr>
<tr><td class="left">UnboundLocalErrorh</td><td class="left">访问未初始化的本地变量</td></tr>
<tr><td class="left">ReferenceError</td><td class="left">弱引用(Weak reference)试图访问已经垃圾回收了的对象</td></tr>
<tr><td class="left">RuntimeError</td><td class="left">一般的运行时错误</td></tr>
<tr><td class="left">NotImplementedErrord</td><td class="left">尚未实现的方法</td></tr>
<tr><td class="left">SyntaxError</td><td class="left">Python语法错误</td></tr>
<tr><td class="left">IndentationError</td><td class="left">缩进错误</td></tr>
<tr><td class="left">TabErrorg</td><td class="left">Tab和空格混用</td></tr>
<tr><td class="left">SystemError</td><td class="left">一般的解释器系统错误</td></tr>
<tr><td class="left">TypeError</td><td class="left">对类型无效的操作</td></tr>
<tr><td class="left">ValueError</td><td class="left">传入无效的参数</td></tr>
<tr><td class="left">UnicodeError</td><td class="left">Unicode 相关的错误</td></tr>
<tr><td class="left">UnicodeDecodeError</td><td class="left">Unicode 解码时的错误</td></tr>
<tr><td class="left">UnicodeEncodeError</td><td class="left">Unicode 编码时错误</td></tr>
<tr><td class="left">UnicodeTranslateErrorf</td><td class="left">Unicode 转换时错误</td></tr>
<tr><td class="left">Warning</td><td class="left">警告的基类</td></tr>
<tr><td class="left">DeprecationWarning</td><td class="left">关于被弃用的特征的警告</td></tr>
<tr><td class="left">FutureWarning</td><td class="left">关于构造将来语义会有改变的警告</td></tr>
<tr><td class="left">OverflowWarning</td><td class="left">旧的关于自动提升为长整型(long)的警告</td></tr>
<tr><td class="left">PendingDeprecationWarning</td><td class="left">关于特性将会被废弃的警告</td></tr>
<tr><td class="left">RuntimeWarning</td><td class="left">可疑的运行时行为(runtime behavior)的警告</td></tr>
<tr><td class="left">SyntaxWarning</td><td class="left">可疑的语法的警告</td></tr>
<tr><td class="left">UserWarning</td><td class="left">用户代码生成的警告</td></tr>
</tbody>
</table>

<ul>
<li>SystemExit,KeyboardInterrupt和Exception派生自BaseException
</li>
<li>其他素有内建异常都派生自Exception
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 函数和函数式编程</h2>
<div class="outline-text-2" id="text-8">


</div>

<div id="outline-container-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> 函数拾遗</h3>
<div class="outline-text-3" id="text-8-1">

<ul>
<li>当没有显式地返回元素或者如果返回None时,python会返回一个None
</li>
<li>如果函数返回多个对象,python把他们聚集起来并以一个元组返回
</li>
<li>关键字参数的概念仅仅针对函数的调用。这种理念是让调用者通过函数调用中的参数名字来区分参数。这样规范允许参数缺失或者不按顺序,因为解释器能通过给出的关键字来匹配参数的值。
</li>
<li>默认参数就是声明了默认值的参数。因为给参数赋予了默认值,所以在函数调用时,不向该参数传入值也是允许的
</li>
<li>Python 同样允许程序员执行一个没有显式定义参数的函数,相应的方法是通过一个把元组(非关键字参数)或字典(关键字参数)作为参数组传递给函数



<pre class="src src-python">func(positional_args, 
     keyword_args,
     *tuple_grp_nonkw_args,
     **dict_grp_kw_args)
</pre>

</li>
<li>Python 也不允许在函数未声明之前,对其进行引用或者调用



<pre class="src src-python"><span style="color: #b22222;">#</span><span style="color: #b22222;">&#27880;&#24847;&#19968;&#31181;&#24773;&#20917;</span>
<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">foo</span>():
    <span style="color: #a020f0;">print</span> <span style="color: #8b2252;">'in foo()'</span>
    bar()
<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">bar</span>():
    <span style="color: #a020f0;">print</span> <span style="color: #8b2252;">'in bar()'</span>
foo()
<span style="color: #b22222;">#</span><span style="color: #b22222;">&#36825;&#27573;&#20195;&#30721;&#26159;&#27491;&#30830;&#30340;&#22240;&#20026;&#21363;&#20351;&#23545;bar()&#36827;&#34892;&#30340;&#35843;&#29992;&#20986;&#29616;&#22312; bar()&#30340;&#23450;&#20041;&#20043;&#21069;, </span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">&#20294;foo()&#26412;&#36523;&#19981;&#26159;&#22312; bar()&#22768;&#26126;&#20043;&#21069;&#34987;&#35843;&#29992;&#30340;&#12290;</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">&#25442;&#21477;&#35805;&#35828;,&#25105;&#20204;&#22768;&#26126; foo(),&#28982;&#21518;&#20877;&#22768;&#26126; bar(),&#25509;&#30528;&#35843;&#29992; foo(),</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">&#20294;&#26159;&#21040;&#37027;&#26102;,bar()&#24050;&#32463;&#23384;&#22312;&#20102;,&#25152;&#20197;&#35843;&#29992;&#25104;&#21151;</span>
</pre>

</li>
<li>在函数体内创建另外一个函数对象是完全合法的。这种函数叫做内部/内嵌函数
</li>
<li>如果内部函数的定义包含了在外部函数里定义的对象的引用(这个对象甚至可以是在外部函数之外),内部函数会变成被称为闭包(closure)
</li>
<li>在python中，函数就像其他对象，是可以被引用的，可以作为参数传入函数,作为列表和字典等等容器对象的元素



<pre class="src src-python">&gt;&gt;&gt; <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">foo</span>():
... <span style="color: #a020f0;">print</span> <span style="color: #8b2252;">'in foo()'</span>
...
&gt;&gt;&gt; <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">bar</span>(argfunc):
... argfunc()
...
&gt;&gt;&gt; bar(foo)
<span style="color: #a020f0;">in</span> foo()
</pre>

</li>
</ul>

</div>

</div>
