src/python核心编程.org
** 参数
+ 位置参数没有任何默认值的话,传入函数的参数数目必须和声明的参数数目一致
+ 可以不按位置地将关键字参数传入函数,给出关键字来匹配其在参数列表中的合适的位置
+ 默认参数
#+BEGIN_QUOTE
#+BEGIN_SRC python
def func(posargs, defarg1=dval1, defarg2=dval2,...):
    ...
#+END_SRC
#+END_QUOTE
+ 可变长的参数必须在位置和默认参数之后
+ 非关键字变长参数
#+BEGIN_QUOTE
#+BEGIN_SRC python
def function_name([formal_args,] *vargs_tuple):
    ...
#+END_SRC
#+END_QUOTE
+ 关键字变长参数
#+BEGIN_QUOTE
#+BEGIN_SRC python
def function_name([formal_args,][*vargs_tuple,] **vargs_dict):
    ...
#+END_SRC
#+END_QUOTE
+ 在函数调用中，可以将非关键字参数放在元组中，将关键字参数放在字典中
#+BEGIN_QUOTE
#+BEGIN_SRC pytho
>>> aTuple = (6, 7, 8)
>>> aDict = {'z': 9}
>>> newfoo(1, 2, 3, x=4, y=5, *aTuple, **aDict)
#+END_SRC
#+END_QUOTE
** 函数式编程
*** lambda
#+BEGIN_SRC python
lambda [arg1[, arg2, ... argN]]: expression
等价于
def func([arg1[, arg2, ... argN]]):
    return expression
#+END_SRC
*** 内建函数apply() filter() map() reduce()
#+BEGIN_SRC python
#用可选的参数来调用 func,nkw 为非关键字参数,kw关键字参数;
#返回值是函数调用的返回值
apply(func[, nkw][, kw])

#调用一个布尔函数 func 来迭代遍历每个 seq 中的元素;
#返回一个使 func 返回值为 ture 的元素的序列。
filter(func, seq)

#将函数 func 作用于给定序列(s)的每个元素,并用一个列表来提供返回值
#如果func为None,返回一个含有每个序列中元素集合的n个元组的列表
map(func, seq1[,seq2...])

#将二元函数作用于 seq 序列的元素,每次携带一对(先前的结果以及下一个序列元素),
#连续的将现有的结果和下一个值作用在获得的随后的结果上,最后减少我们的序列为一个单一的返回值;
#如果初始值 init 给定,第一个比较会是 init 和第一个序列元素而不是序列的头两个元素。
reduce(func, seq[, init])
#+END_SRC
+ 现在函数调用的语法允许变长参数，因此apply()将来会被逐步淘汰
+ 对于map函数，其中提供了多少个seq，func就应接受多少个参数
+ 对于reduce函数，如果没有提供init，函数首先取seq的前两个元素合并，如果提供了init，函数首先取init和seq的第一个元素计算结果
** 变量作用域
*** global
在局部作用域中，为了明确地引用一个已命名的全局变量,必须使用 global 语句
*** 闭包
+ 如果在一个内部函数里,对在外部作用域(但不是在全局作用域)的变量进行引用,那么内部函数就被认为是闭包
+ 定义在外部函数内的但由内部函数引用或者使用的变量被称为自由变量

** 生成器
与迭代器相似，生成器对象有next()方法，当没有更多值返回时抛出StopIteration异常
#+BEGIN_SRC python
def simpleGen():
    yield 1
    yield '2 --> punch!'
>>> myG = simpleGen()
>>> myG.next()
1
>>> myG.next()
'2 --> punch!'
>>> myG.next()
Traceback (most recent call last):
File "", line 1, in ?
myG.next() StopIteration
#+END_SRC
* 模块
+ 模块的文件名就是模块的名字加上扩展名.py
+ 与其他可以导入类的语言不同,在python中导入的是模块或模块属性
** 搜索路径
+ 通过PYTHONPATH环境变量设置搜索路径
+ sys.path保存了搜索路径的列表,通过sys.path.append()方法添加搜索路径
+ sys.modules是一个字典,使用sys.modules保存了当前导入的模块和这些模块的路径
** 名称空间
在程序执行期间有两个或三个活动的名称空间
1. 局部名称空间(在执行期间是不断变化的)
2. 全局名称空间
3. 内建名称空间
*** 名称空间的加载顺序
1. python解释器首先加载内建名称空间(由__builtins__模块中的名字构成),
2. 随后加载执行模块的全局名称空间,它会在模块开始执行后变为活动名称空间,
3. 如果在执行期间调用了一个函数,那么将创建出局部名称空间.
可以通过globals()或locals()内建函数判断一个名字所属的名称空间.
*** 名称查找
访问一个属性时,解释器必须在三个名称空间中的一个找他它
1. 首先在局部名称空间找
2. 如果没有找到,继续在全局名称空间找
3. 如果没有找到,将在内建名称空间找
如果所有尝试都失败了,将产生NameError错误
** 导入模块
#+BEGIN_SRC python
import module

#不推荐,最好一行导入一个模块
import module1[, module2[,... moduleN]]

#导入指定的模块属性(把指定名称导入到当前作用域)
from module import name1[, name2[,... nameN]] 

#替换模块的原始名称
import module as other_name
from module import name as other_name
#+END_SRC
*** 模块导入的特性
+ 被导入模块的顶层代码会被执行
+ 一个模块可以被多次导入,但是只会被加载(执行)一次
+ 使用from-import可以把名字导入到当前名称空间里去
+ 使用from-import,对这些变量的改变只影响它在当前空间中的拷贝,对原始空间没有影响
+ 对于那些在新版本中可能会成为标准的新特性,可以通过from __future__import name导入,但是不能直接import __future__
+ 属性名前加下划线,可以阻止属性在"from module import * "时被导入,不过如果导入的是模块,或显式地导入某个属性(如foo._bar),这个隐藏数据的方法就不起作用了
** 内建函数
*** __import__()
__import__()是导入模块的函数,import语句就是调用这个函数来完成工作
#+BEGIN_SRC python
__import__(module_name[, globals[, locals[, fromlist]]])
#+END_SRC
+ module_name变量是要导入模块的名称
+ globals 是包含当前全局符号表的名字的字典,
+ locals 是包含局部符号表的名字的字典
+ fromlist 是一个使用 from-import 语句所导入符号的列表
+ globals, locals, 以及fromlist参数都是可选的,默认分别为globals(),locals()和[]
*** globals()和locals()
globals() 和 locals() 内建函数分别返回调用者全局和局部名称空间的字典
*** reload()
reload() 内建函数可以重新导入一个已经导入的模块
#+BEGIN_SRC python
reload(module)
#+END_SRC
+ reload的参数必须是模块对象,不能是代表模块的字符串
+ reload会导致模块被再次执行
** 包
#+BEGIN_EXAMPLE
phtone/
    __init__.py
    common_utils.py
    mobile/
        __init__.py
        analog.py
        digital.py
#+END_EXAMPLE
