html/python核心编程.html

<div id="outline-container-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> <span class="todo TODO">TODO</span> 装饰器</h3>
<div class="outline-text-3" id="text-8-2">

</div>

</div>

<div id="outline-container-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> 参数</h3>
<div class="outline-text-3" id="text-8-3">

<ul>
<li>位置参数没有任何默认值的话,传入函数的参数数目必须和声明的参数数目一致
</li>
<li>可以不按位置地将关键字参数传入函数,给出关键字来匹配其在参数列表中的合适的位置
</li>
<li>默认参数
</li>
</ul>

<blockquote>




<pre class="src src-python"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">func</span>(posargs, defarg1=dval1, defarg2=dval2,...):
    ...
</pre>


</blockquote>


<ul>
<li>可变长的参数必须在位置和默认参数之后
</li>
<li>非关键字变长参数
</li>
</ul>

<blockquote>




<pre class="src src-python"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">function_name</span>([formal_args,] *vargs_tuple):
    ...
</pre>


</blockquote>


<ul>
<li>关键字变长参数
</li>
</ul>

<blockquote>




<pre class="src src-python"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">function_name</span>([formal_args,][*vargs_tuple,] **vargs_dict):
    ...
</pre>


</blockquote>


<ul>
<li>在函数调用中，可以将非关键字参数放在元组中，将关键字参数放在字典中
</li>
</ul>

<blockquote>




<pre class="src src-pytho">&gt;&gt;&gt; aTuple = (6, 7, 8)
&gt;&gt;&gt; aDict = {'z': 9}
&gt;&gt;&gt; newfoo(1, 2, 3, x=4, y=5, *aTuple, **aDict)
</pre>


</blockquote>


</div>

</div>

<div id="outline-container-8-4" class="outline-3">
<h3 id="sec-8-4"><span class="section-number-3">8.4</span> 函数式编程</h3>
<div class="outline-text-3" id="text-8-4">


</div>

<div id="outline-container-8-4-1" class="outline-4">
<h4 id="sec-8-4-1"><span class="section-number-4">8.4.1</span> lambda</h4>
<div class="outline-text-4" id="text-8-4-1">




<pre class="src src-python"><span style="color: #a020f0;">lambda</span> [arg1[, arg2, ... argN]]: expression
&#31561;&#20215;&#20110;
<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">func</span>([arg1[, arg2, ... argN]]):
    <span style="color: #a020f0;">return</span> expression
</pre>

</div>

</div>

<div id="outline-container-8-4-2" class="outline-4">
<h4 id="sec-8-4-2"><span class="section-number-4">8.4.2</span> 内建函数apply() filter() map() reduce()</h4>
<div class="outline-text-4" id="text-8-4-2">




<pre class="src src-python"><span style="color: #b22222;">#</span><span style="color: #b22222;">&#29992;&#21487;&#36873;&#30340;&#21442;&#25968;&#26469;&#35843;&#29992; func,nkw &#20026;&#38750;&#20851;&#38190;&#23383;&#21442;&#25968;,kw&#20851;&#38190;&#23383;&#21442;&#25968;;</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">&#36820;&#22238;&#20540;&#26159;&#20989;&#25968;&#35843;&#29992;&#30340;&#36820;&#22238;&#20540;</span>
<span style="color: #483d8b;">apply</span>(func[, nkw][, kw])

<span style="color: #b22222;">#</span><span style="color: #b22222;">&#35843;&#29992;&#19968;&#20010;&#24067;&#23572;&#20989;&#25968; func &#26469;&#36845;&#20195;&#36941;&#21382;&#27599;&#20010; seq &#20013;&#30340;&#20803;&#32032;;</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">&#36820;&#22238;&#19968;&#20010;&#20351; func &#36820;&#22238;&#20540;&#20026; ture &#30340;&#20803;&#32032;&#30340;&#24207;&#21015;&#12290;</span>
<span style="color: #483d8b;">filter</span>(func, seq)

<span style="color: #b22222;">#</span><span style="color: #b22222;">&#23558;&#20989;&#25968; func &#20316;&#29992;&#20110;&#32473;&#23450;&#24207;&#21015;(s)&#30340;&#27599;&#20010;&#20803;&#32032;,&#24182;&#29992;&#19968;&#20010;&#21015;&#34920;&#26469;&#25552;&#20379;&#36820;&#22238;&#20540;</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">&#22914;&#26524;func&#20026;None,&#36820;&#22238;&#19968;&#20010;&#21547;&#26377;&#27599;&#20010;&#24207;&#21015;&#20013;&#20803;&#32032;&#38598;&#21512;&#30340;n&#20010;&#20803;&#32452;&#30340;&#21015;&#34920;</span>
<span style="color: #483d8b;">map</span>(func, seq1[,seq2...])

<span style="color: #b22222;">#</span><span style="color: #b22222;">&#23558;&#20108;&#20803;&#20989;&#25968;&#20316;&#29992;&#20110; seq &#24207;&#21015;&#30340;&#20803;&#32032;,&#27599;&#27425;&#25658;&#24102;&#19968;&#23545;(&#20808;&#21069;&#30340;&#32467;&#26524;&#20197;&#21450;&#19979;&#19968;&#20010;&#24207;&#21015;&#20803;&#32032;),</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">&#36830;&#32493;&#30340;&#23558;&#29616;&#26377;&#30340;&#32467;&#26524;&#21644;&#19979;&#19968;&#20010;&#20540;&#20316;&#29992;&#22312;&#33719;&#24471;&#30340;&#38543;&#21518;&#30340;&#32467;&#26524;&#19978;,&#26368;&#21518;&#20943;&#23569;&#25105;&#20204;&#30340;&#24207;&#21015;&#20026;&#19968;&#20010;&#21333;&#19968;&#30340;&#36820;&#22238;&#20540;;</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">&#22914;&#26524;&#21021;&#22987;&#20540; init &#32473;&#23450;,&#31532;&#19968;&#20010;&#27604;&#36739;&#20250;&#26159; init &#21644;&#31532;&#19968;&#20010;&#24207;&#21015;&#20803;&#32032;&#32780;&#19981;&#26159;&#24207;&#21015;&#30340;&#22836;&#20004;&#20010;&#20803;&#32032;&#12290;</span>
<span style="color: #483d8b;">reduce</span>(func, seq[, init])
</pre>

<ul>
<li>现在函数调用的语法允许变长参数，因此apply()将来会被逐步淘汰
</li>
<li>对于map函数，其中提供了多少个seq，func就应接受多少个参数
</li>
<li>对于reduce函数，如果没有提供init，函数首先取seq的前两个元素合并，如果提供了init，函数首先取init和seq的第一个元素计算结果
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-8-5" class="outline-3">
<h3 id="sec-8-5"><span class="section-number-3">8.5</span> 变量作用域</h3>
<div class="outline-text-3" id="text-8-5">


</div>

<div id="outline-container-8-5-1" class="outline-4">
<h4 id="sec-8-5-1"><span class="section-number-4">8.5.1</span> global</h4>
<div class="outline-text-4" id="text-8-5-1">

<p>在局部作用域中，为了明确地引用一个已命名的全局变量,必须使用 global 语句
</p></div>

</div>

<div id="outline-container-8-5-2" class="outline-4">
<h4 id="sec-8-5-2"><span class="section-number-4">8.5.2</span> 闭包</h4>
<div class="outline-text-4" id="text-8-5-2">

<ul>
<li>如果在一个内部函数里,对在外部作用域(但不是在全局作用域)的变量进行引用,那么内部函数就被认为是闭包
</li>
<li>定义在外部函数内的但由内部函数引用或者使用的变量被称为自由变量
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-8-6" class="outline-3">
<h3 id="sec-8-6"><span class="section-number-3">8.6</span> 生成器</h3>
<div class="outline-text-3" id="text-8-6">

<p>与迭代器相似，生成器对象有next()方法，当没有更多值返回时抛出StopIteration异常
</p>


<pre class="src src-python"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">simpleGen</span>():
    <span style="color: #a020f0;">yield</span> 1
    <span style="color: #a020f0;">yield</span> <span style="color: #8b2252;">'2 --&gt; punch!'</span>
&gt;&gt;&gt; <span style="color: #a0522d;">myG</span> = simpleGen()
&gt;&gt;&gt; myG.<span style="color: #483d8b;">next</span>()
1
&gt;&gt;&gt; myG.<span style="color: #483d8b;">next</span>()
<span style="color: #8b2252;">'2 --&gt; punch!'</span>
&gt;&gt;&gt; myG.<span style="color: #483d8b;">next</span>()
Traceback (most recent call last):
File <span style="color: #8b2252;">""</span>, line 1, <span style="color: #a020f0;">in</span> ?
myG.<span style="color: #483d8b;">next</span>() <span style="color: #228b22;">StopIteration</span>
</pre>

</div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> 模块</h2>
<div class="outline-text-2" id="text-9">

<ul>
<li>模块的文件名就是模块的名字加上扩展名.py
</li>
<li>与其他可以导入类的语言不同,在python中导入的是模块或模块属性
</li>
</ul>


</div>

<div id="outline-container-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> 搜索路径</h3>
<div class="outline-text-3" id="text-9-1">

<ul>
<li>通过PYTHONPATH环境变量设置搜索路径
</li>
<li>sys.path保存了搜索路径的列表,通过sys.path.append()方法添加搜索路径
</li>
<li>sys.modules是一个字典,使用sys.modules保存了当前导入的模块和这些模块的路径
</li>
</ul>

</div>

</div>

<div id="outline-container-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> 名称空间</h3>
<div class="outline-text-3" id="text-9-2">

<p>在程序执行期间有两个或三个活动的名称空间
</p><ol>
<li>局部名称空间(在执行期间是不断变化的)
</li>
<li>全局名称空间
</li>
<li>内建名称空间
</li>
</ol>


</div>

<div id="outline-container-9-2-1" class="outline-4">
<h4 id="sec-9-2-1"><span class="section-number-4">9.2.1</span> 名称空间的加载顺序</h4>
<div class="outline-text-4" id="text-9-2-1">

<ol>
<li>python解释器首先加载内建名称空间(由__builtins__模块中的名字构成),
</li>
<li>随后加载执行模块的全局名称空间,它会在模块开始执行后变为活动名称空间,
</li>
<li>如果在执行期间调用了一个函数,那么将创建出局部名称空间.
</li>
</ol>

<p>可以通过globals()或locals()内建函数判断一个名字所属的名称空间.
</p></div>

</div>

<div id="outline-container-9-2-2" class="outline-4">
<h4 id="sec-9-2-2"><span class="section-number-4">9.2.2</span> 名称查找</h4>
<div class="outline-text-4" id="text-9-2-2">

<p>访问一个属性时,解释器必须在三个名称空间中的一个找他它
</p><ol>
<li>首先在局部名称空间找
</li>
<li>如果没有找到,继续在全局名称空间找
</li>
<li>如果没有找到,将在内建名称空间找
</li>
</ol>

<p>如果所有尝试都失败了,将产生NameError错误
</p></div>
</div>

</div>

<div id="outline-container-9-3" class="outline-3">
<h3 id="sec-9-3"><span class="section-number-3">9.3</span> 导入模块</h3>
<div class="outline-text-3" id="text-9-3">




<pre class="src src-python"><span style="color: #a020f0;">import</span> module

<span style="color: #b22222;">#</span><span style="color: #b22222;">&#19981;&#25512;&#33616;,&#26368;&#22909;&#19968;&#34892;&#23548;&#20837;&#19968;&#20010;&#27169;&#22359;</span>
<span style="color: #a020f0;">import</span> module1[, module2[,... moduleN]]

<span style="color: #b22222;">#</span><span style="color: #b22222;">&#23548;&#20837;&#25351;&#23450;&#30340;&#27169;&#22359;&#23646;&#24615;(&#25226;&#25351;&#23450;&#21517;&#31216;&#23548;&#20837;&#21040;&#24403;&#21069;&#20316;&#29992;&#22495;)</span>
<span style="color: #a020f0;">from</span> module <span style="color: #a020f0;">import</span> name1[, name2[,... nameN]] 

<span style="color: #b22222;">#</span><span style="color: #b22222;">&#26367;&#25442;&#27169;&#22359;&#30340;&#21407;&#22987;&#21517;&#31216;</span>
<span style="color: #a020f0;">import</span> module <span style="color: #a020f0;">as</span> other_name
<span style="color: #a020f0;">from</span> module <span style="color: #a020f0;">import</span> name <span style="color: #a020f0;">as</span> other_name
</pre>


</div>

<div id="outline-container-9-3-1" class="outline-4">
<h4 id="sec-9-3-1"><span class="section-number-4">9.3.1</span> 模块导入的特性</h4>
<div class="outline-text-4" id="text-9-3-1">

<ul>
<li>被导入模块的顶层代码会被执行
</li>
<li>一个模块可以被多次导入,但是只会被加载(执行)一次
</li>
<li>使用from-import可以把名字导入到当前名称空间里去
</li>
<li>使用from-import,对这些变量的改变只影响它在当前空间中的拷贝,对原始空间没有影响
</li>
<li>对于那些在新版本中可能会成为标准的新特性,可以通过from __future__import name导入,但是不能直接import __future__
</li>
<li>属性名前加下划线,可以阻止属性在"from module import * "时被导入,不过如果导入的是模块,或显式地导入某个属性(如foo._bar),这个隐藏数据的方法就不起作用了
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-9-4" class="outline-3">
<h3 id="sec-9-4"><span class="section-number-3">9.4</span> 内建函数</h3>
<div class="outline-text-3" id="text-9-4">


</div>

<div id="outline-container-9-4-1" class="outline-4">
<h4 id="sec-9-4-1"><span class="section-number-4">9.4.1</span> __import__()</h4>
<div class="outline-text-4" id="text-9-4-1">

<p>__import__()是导入模块的函数,import语句就是调用这个函数来完成工作
</p>


<pre class="src src-python"><span style="color: #483d8b;">__import__</span>(module_name[, <span style="color: #483d8b;">globals</span>[, <span style="color: #483d8b;">locals</span>[, fromlist]]])
</pre>

<ul>
<li>module_name变量是要导入模块的名称
</li>
<li>globals 是包含当前全局符号表的名字的字典,
</li>
<li>locals 是包含局部符号表的名字的字典
</li>
<li>fromlist 是一个使用 from-import 语句所导入符号的列表
</li>
<li>globals, locals, 以及fromlist参数都是可选的,默认分别为globals(),locals()和[]
</li>
</ul>

</div>

</div>

<div id="outline-container-9-4-2" class="outline-4">
<h4 id="sec-9-4-2"><span class="section-number-4">9.4.2</span> globals()和locals()</h4>
<div class="outline-text-4" id="text-9-4-2">

<p>globals() 和 locals() 内建函数分别返回调用者全局和局部名称空间的字典
</p></div>

</div>

<div id="outline-container-9-4-3" class="outline-4">
<h4 id="sec-9-4-3"><span class="section-number-4">9.4.3</span> reload()</h4>
<div class="outline-text-4" id="text-9-4-3">

<p>reload() 内建函数可以重新导入一个已经导入的模块
</p>


<pre class="src src-python"><span style="color: #483d8b;">reload</span>(module)
</pre>

<ul>
<li>reload的参数必须是模块对象,不能是代表模块的字符串
</li>
<li>reload会导致模块被再次执行
</li>
</ul>

</div>
</div>

</div>
