src/python核心编程.org
*** 导入子包
#+BEGIN_SRC python
import phone.mobile.analog
phone.mobile.analog.dial()

from phone import mobile
mobile.analog.dial()

from phone.mobile import analog
analog.dial()

from phone.mobile.analog import dial
dial()
#+END_SRC
*** __init__.py
+ __init__.py文件是初始化模块,from-import语句导入子包时需要用到它
+ 如果没有用到,它们可以是空文件
+ 使用from package.module import *导入所有属性时,会查找__init__.py中__all__变量,该变量是一个模块名字符串列表,包含执行这条语句时应该导入的模块的名字
*** 相对导入
#+BEGIN_SRC python
假设在digital.py文件中导入
from phone.mobile.analog import dial  #绝对导入
from .analog import dial #相对导入
from ..common_util import setup  #相对导入
#+END_SRC
+ import语句总是绝对导入的,即这些名字必须通过搜索路径来访问
+ 所以相对导入只应用于from-import语句

* 面向对象编程
** 类
*** 创建类
#+BEGIN_SRC python
class ClassName(bases):
    'class documentation string'
    class_suite #类体
#+END_SRC
*** 类属性
**** 类的数据属性
也就是静态数据属性,类的数据属性通过类名访问
#+BEGIN_SRC python
>> class C(object):
... foo = 100
>>> print C.foo
#+END_SRC
**** 方法 
尽管方法是类的属性,但是方法只能由类的实例来调用
#+BEGIN_SRC python
>>> class MyClass(object):
...    def myNoActionMethod(self):
...        pass
>>> mc = MyClass()
>>> mc.myNoActionMethod()
#+END_SRC
*** 查看类的属性
+ dir(classname) 返回对象属性的名字列表
+ classname.__dict__ 返回字典,键是属性名,值是属性对象的数据值
*** 特殊的类属性
#+ATTR_HTML: border="2" rules="all" frame="border"
| 特殊属性   | 涵义                     |
|------------+--------------------------|
| __name__   | 类的名字(字符串)         |
| __doc__    | 类的文档字符串           |
| __bases__  | 类的所有父类构成的元组   |
| __dict__   | 类的属性                 |
| __module__ | 类定义所在的模块         |
| __class__  | 实例对应的类(仅新式类中) |
** 实例
*** 创建实例
#+BEGIN_SRC python
>>> class MyClass(object):
# define class 定义类
... pass
>>> mc = MyClass() #得到实例
#+END_SRC
+ 创建实例不用new,而是类似于函数调用的方式
+ python会首先创建该实例,而后调用__init__()方法,也即__init__()方法是在创建实例后调用的第一个方法,用于在开始使用实例之前做些准备工作
*** 实例属性
+ 实例仅拥有数据属性(方法严格来说是类属性)
+ 当一个实例被释放后,它的属性同时也被清除了
+ 设置实例的属性可以在实例创建后任意时间进行(__init__()是最早的可以设置实例属性的地方)
+ python允许动态创建实例属性
#+BEGIN_QUOTE
#+BEGIN_SRC python
>>> class MyClass(object):
...     pass
... 
>>> mc = MyClass()
>>> mc.name = 'wch'
>>> mc.name
'wch'
#+END_SRC
#+END_QUOTE
*** 查看实例属性
+ dir(instance)
+ instance.__dict__
*** 特殊实例属性
#+ATTR_HTML: border="2" rules="all" frame="border"
| 特殊属性  | 涵义         |
|-----------+--------------|
| __class__ | 实例所属的类 |
| __dict__  | 实例的属性   |
*** 类数据属性 vs 实例数据属性
+ 类和实例都是名字空间:类是类属性的名字空间,实例则是实例属性的
+ 用类来访问类数据属性,如果实例没有同名的属性,也可以用实例来访问
#+BEGIN_QUOTE
#+BEGIN_SRC python
>>> class C(object):       #定义类
...     version = 1.2      #静态成员
...
>>> c = C()                #实例化
>>> C.version              #通过类来访问
1.2
>>> c.version              #通过实例来访问
1.2
>>> C.version += 0.1       #通过类(只能这样)来更新
>>> C.version              #类访问
1.3
>>> c.version              #实例访问它,其值已被改变
1.3
#+END_SRC
#+END_QUOTE
+ 任何对实例属性的赋值都会创建一个实例属性(如果不存在的话)并且对其赋值,因此, *不能使用实例访问类数据属性来更新它的值*
#+BEGIN_SRC python
>>> class Foo(object):
...     x = 1.5
...
>>> foo = Foo()
>>> foo.x               #访问的是类属性
1.5
>>> foo.x = 1.7         #试着更新类属性,实际上创建了一个新的实例属性
>>> foo.x               
1.7
>>> Foo.x               #类属性依然没有改变
1.5
>>> del foo.x           #删除实例属性
>>> foo.x               #又可以访问到类属性
1.5

#+END_SRC
** 方法
+ 方法是类的属性
+ 方法只能被类的实例调用
+ 方法定义中的第一个参数都是变量self,表示调用此方法的实例对象
