html/python核心编程.html

<div id="outline-container-9-5" class="outline-3">
<h3 id="sec-9-5"><span class="section-number-3">9.5</span> 包</h3>
<div class="outline-text-3" id="text-9-5">




<pre class="example">phtone/
    __init__.py
    common_utils.py
    mobile/
        __init__.py
        analog.py
        digital.py
</pre>


</div>

<div id="outline-container-9-5-1" class="outline-4">
<h4 id="sec-9-5-1"><span class="section-number-4">9.5.1</span> 导入子包</h4>
<div class="outline-text-4" id="text-9-5-1">




<pre class="src src-python"><span style="color: #a020f0;">import</span> phone.mobile.analog
phone.mobile.analog.dial()

<span style="color: #a020f0;">from</span> phone <span style="color: #a020f0;">import</span> mobile
mobile.analog.dial()

<span style="color: #a020f0;">from</span> phone.mobile <span style="color: #a020f0;">import</span> analog
analog.dial()

<span style="color: #a020f0;">from</span> phone.mobile.analog <span style="color: #a020f0;">import</span> dial
dial()
</pre>

</div>

</div>

<div id="outline-container-9-5-2" class="outline-4">
<h4 id="sec-9-5-2"><span class="section-number-4">9.5.2</span> __init__.py</h4>
<div class="outline-text-4" id="text-9-5-2">

<ul>
<li>__init__.py文件是初始化模块,from-import语句导入子包时需要用到它
</li>
<li>如果没有用到,它们可以是空文件
</li>
<li>使用from package.module import *导入所有属性时,会查找__init__.py中__all__变量,该变量是一个模块名字符串列表,包含执行这条语句时应该导入的模块的名字
</li>
</ul>

</div>

</div>

<div id="outline-container-9-5-3" class="outline-4">
<h4 id="sec-9-5-3"><span class="section-number-4">9.5.3</span> 相对导入</h4>
<div class="outline-text-4" id="text-9-5-3">




<pre class="src src-python">&#20551;&#35774;&#22312;digital.py&#25991;&#20214;&#20013;&#23548;&#20837;
<span style="color: #a020f0;">from</span> phone.mobile.analog <span style="color: #a020f0;">import</span> dial  <span style="color: #b22222;">#</span><span style="color: #b22222;">&#32477;&#23545;&#23548;&#20837;</span>
<span style="color: #a020f0;">from</span> .analog <span style="color: #a020f0;">import</span> dial <span style="color: #b22222;">#</span><span style="color: #b22222;">&#30456;&#23545;&#23548;&#20837;</span>
<span style="color: #a020f0;">from</span> ..common_util <span style="color: #a020f0;">import</span> setup  <span style="color: #b22222;">#</span><span style="color: #b22222;">&#30456;&#23545;&#23548;&#20837;</span>
</pre>

<ul>
<li>import语句总是绝对导入的,即这些名字必须通过搜索路径来访问
</li>
<li>所以相对导入只应用于from-import语句
</li>
</ul>


</div>
</div>
</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> 面向对象编程</h2>
<div class="outline-text-2" id="text-10">


</div>

<div id="outline-container-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> 类</h3>
<div class="outline-text-3" id="text-10-1">


</div>

<div id="outline-container-10-1-1" class="outline-4">
<h4 id="sec-10-1-1"><span class="section-number-4">10.1.1</span> 创建类</h4>
<div class="outline-text-4" id="text-10-1-1">




<pre class="src src-python"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">ClassName</span>(bases):
    <span style="color: #8b2252;">'class documentation string'</span>
    class_suite <span style="color: #b22222;">#</span><span style="color: #b22222;">&#31867;&#20307;</span>
</pre>

</div>

</div>

<div id="outline-container-10-1-2" class="outline-4">
<h4 id="sec-10-1-2"><span class="section-number-4">10.1.2</span> 类属性</h4>
<div class="outline-text-4" id="text-10-1-2">

<ul>
<li id="sec-10-1-2-1">类的数据属性<br/>
也就是静态数据属性,类的数据属性通过类名访问



<pre class="src src-python">&gt;&gt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">C</span>(<span style="color: #483d8b;">object</span>):
... <span style="color: #a0522d;">foo</span> = 100
&gt;&gt;&gt; <span style="color: #a020f0;">print</span> C.foo
</pre>

</li>
</ul>
<ul>
<li id="sec-10-1-2-2">方法<br/>
尽管方法是类的属性,但是方法只能由类的实例来调用



<pre class="src src-python">&gt;&gt;&gt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">MyClass</span>(<span style="color: #483d8b;">object</span>):
...    <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">myNoActionMethod</span>(<span style="color: #a020f0;">self</span>):
...        <span style="color: #a020f0;">pass</span>
&gt;&gt;&gt; <span style="color: #a0522d;">mc</span> = MyClass()
&gt;&gt;&gt; mc.myNoActionMethod()
</pre>

</li>
</ul>
</div>

</div>

<div id="outline-container-10-1-3" class="outline-4">
<h4 id="sec-10-1-3"><span class="section-number-4">10.1.3</span> 查看类的属性</h4>
<div class="outline-text-4" id="text-10-1-3">

<ul>
<li>dir(classname) 返回对象属性的名字列表
</li>
<li>classname.__dict__ 返回字典,键是属性名,值是属性对象的数据值
</li>
</ul>

</div>

</div>

<div id="outline-container-10-1-4" class="outline-4">
<h4 id="sec-10-1-4"><span class="section-number-4">10.1.4</span> 特殊的类属性</h4>
<div class="outline-text-4" id="text-10-1-4">

<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">特殊属性</th><th scope="col" class="left">涵义</th></tr>
</thead>
<tbody>
<tr><td class="left">__name__</td><td class="left">类的名字(字符串)</td></tr>
<tr><td class="left">__doc__</td><td class="left">类的文档字符串</td></tr>
<tr><td class="left">__bases__</td><td class="left">类的所有父类构成的元组</td></tr>
<tr><td class="left">__dict__</td><td class="left">类的属性</td></tr>
<tr><td class="left">__module__</td><td class="left">类定义所在的模块</td></tr>
<tr><td class="left">__class__</td><td class="left">实例对应的类(仅新式类中)</td></tr>
</tbody>
</table>

</div>
</div>

</div>

<div id="outline-container-10-2" class="outline-3">
<h3 id="sec-10-2"><span class="section-number-3">10.2</span> 实例</h3>
<div class="outline-text-3" id="text-10-2">


</div>

<div id="outline-container-10-2-1" class="outline-4">
<h4 id="sec-10-2-1"><span class="section-number-4">10.2.1</span> 创建实例</h4>
<div class="outline-text-4" id="text-10-2-1">




<pre class="src src-python">&gt;&gt;&gt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">MyClass</span>(<span style="color: #483d8b;">object</span>):
<span style="color: #b22222;"># </span><span style="color: #b22222;">define class &#23450;&#20041;&#31867;</span>
... <span style="color: #a020f0;">pass</span>
&gt;&gt;&gt; <span style="color: #a0522d;">mc</span> = MyClass() <span style="color: #b22222;">#</span><span style="color: #b22222;">&#24471;&#21040;&#23454;&#20363;</span>
</pre>

<ul>
<li>创建实例不用new,而是类似于函数调用的方式
</li>
<li>python会首先创建该实例,而后调用__init__()方法,也即__init__()方法是在创建实例后调用的第一个方法,用于在开始使用实例之前做些准备工作
</li>
</ul>

</div>

</div>

<div id="outline-container-10-2-2" class="outline-4">
<h4 id="sec-10-2-2"><span class="section-number-4">10.2.2</span> 实例属性</h4>
<div class="outline-text-4" id="text-10-2-2">

<ul>
<li>实例仅拥有数据属性(方法严格来说是类属性)
</li>
<li>当一个实例被释放后,它的属性同时也被清除了
</li>
<li>设置实例的属性可以在实例创建后任意时间进行(__init__()是最早的可以设置实例属性的地方)
</li>
<li>python允许动态创建实例属性
</li>
</ul>

<blockquote>




<pre class="src src-python">&gt;&gt;&gt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">MyClass</span>(<span style="color: #483d8b;">object</span>):
...     <span style="color: #a020f0;">pass</span>
... 
&gt;&gt;&gt; <span style="color: #a0522d;">mc</span> = MyClass()
&gt;&gt;&gt; <span style="color: #a0522d;">mc.name</span> = <span style="color: #8b2252;">'wch'</span>
&gt;&gt;&gt; mc.name
<span style="color: #8b2252;">'wch'</span>
</pre>


</blockquote>


</div>

</div>

<div id="outline-container-10-2-3" class="outline-4">
<h4 id="sec-10-2-3"><span class="section-number-4">10.2.3</span> 查看实例属性</h4>
<div class="outline-text-4" id="text-10-2-3">

<ul>
<li>dir(instance)
</li>
<li>instance.__dict__
</li>
</ul>

</div>

</div>

<div id="outline-container-10-2-4" class="outline-4">
<h4 id="sec-10-2-4"><span class="section-number-4">10.2.4</span> 特殊实例属性</h4>
<div class="outline-text-4" id="text-10-2-4">

<table  border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">特殊属性</th><th scope="col" class="left">涵义</th></tr>
</thead>
<tbody>
<tr><td class="left">__class__</td><td class="left">实例所属的类</td></tr>
<tr><td class="left">__dict__</td><td class="left">实例的属性</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-10-2-5" class="outline-4">
<h4 id="sec-10-2-5"><span class="section-number-4">10.2.5</span> 类数据属性 vs 实例数据属性</h4>
<div class="outline-text-4" id="text-10-2-5">

<ul>
<li>类和实例都是名字空间:类是类属性的名字空间,实例则是实例属性的
</li>
<li>用类来访问类数据属性,如果实例没有同名的属性,也可以用实例来访问
</li>
</ul>

<blockquote>




<pre class="src src-python">&gt;&gt;&gt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">C</span>(<span style="color: #483d8b;">object</span>):       <span style="color: #b22222;">#</span><span style="color: #b22222;">&#23450;&#20041;&#31867;</span>
...     <span style="color: #a0522d;">version</span> = 1.2      <span style="color: #b22222;">#</span><span style="color: #b22222;">&#38745;&#24577;&#25104;&#21592;</span>
...
&gt;&gt;&gt; <span style="color: #a0522d;">c</span> = C()                <span style="color: #b22222;">#</span><span style="color: #b22222;">&#23454;&#20363;&#21270;</span>
&gt;&gt;&gt; C.version              <span style="color: #b22222;">#</span><span style="color: #b22222;">&#36890;&#36807;&#31867;&#26469;&#35775;&#38382;</span>
1.2
&gt;&gt;&gt; c.version              <span style="color: #b22222;">#</span><span style="color: #b22222;">&#36890;&#36807;&#23454;&#20363;&#26469;&#35775;&#38382;</span>
1.2
&gt;&gt;&gt; <span style="color: #a0522d;">C.version</span> += 0.1       <span style="color: #b22222;">#</span><span style="color: #b22222;">&#36890;&#36807;&#31867;(&#21482;&#33021;&#36825;&#26679;)&#26469;&#26356;&#26032;</span>
&gt;&gt;&gt; C.version              <span style="color: #b22222;">#</span><span style="color: #b22222;">&#31867;&#35775;&#38382;</span>
1.3
&gt;&gt;&gt; c.version              <span style="color: #b22222;">#</span><span style="color: #b22222;">&#23454;&#20363;&#35775;&#38382;&#23427;,&#20854;&#20540;&#24050;&#34987;&#25913;&#21464;</span>
1.3
</pre>


</blockquote>


<ul>
<li>任何对实例属性的赋值都会创建一个实例属性(如果不存在的话)并且对其赋值,因此, <b>不能使用实例访问类数据属性来更新它的值</b>
</li>
</ul>




<pre class="src src-python">&gt;&gt;&gt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Foo</span>(<span style="color: #483d8b;">object</span>):
...     <span style="color: #a0522d;">x</span> = 1.5
...
&gt;&gt;&gt; <span style="color: #a0522d;">foo</span> = Foo()
&gt;&gt;&gt; foo.x               <span style="color: #b22222;">#</span><span style="color: #b22222;">&#35775;&#38382;&#30340;&#26159;&#31867;&#23646;&#24615;</span>
1.5
&gt;&gt;&gt; <span style="color: #a0522d;">foo.x</span> = 1.7         <span style="color: #b22222;">#</span><span style="color: #b22222;">&#35797;&#30528;&#26356;&#26032;&#31867;&#23646;&#24615;,&#23454;&#38469;&#19978;&#21019;&#24314;&#20102;&#19968;&#20010;&#26032;&#30340;&#23454;&#20363;&#23646;&#24615;</span>
&gt;&gt;&gt; foo.x               
1.7
&gt;&gt;&gt; Foo.x               <span style="color: #b22222;">#</span><span style="color: #b22222;">&#31867;&#23646;&#24615;&#20381;&#28982;&#27809;&#26377;&#25913;&#21464;</span>
1.5
&gt;&gt;&gt; <span style="color: #a020f0;">del</span> foo.x           <span style="color: #b22222;">#</span><span style="color: #b22222;">&#21024;&#38500;&#23454;&#20363;&#23646;&#24615;</span>
&gt;&gt;&gt; foo.x               <span style="color: #b22222;">#</span><span style="color: #b22222;">&#21448;&#21487;&#20197;&#35775;&#38382;&#21040;&#31867;&#23646;&#24615;</span>
1.5

</pre>

</div>
</div>

</div>

<div id="outline-container-10-3" class="outline-3">
<h3 id="sec-10-3"><span class="section-number-3">10.3</span> 方法</h3>
<div class="outline-text-3" id="text-10-3">

<ul>
<li>方法是类的属性
</li>
<li>方法只能被类的实例调用
</li>
<li>方法定义中的第一个参数都是变量self,表示调用此方法的实例对象
</li>
</ul>


</div>
