src/python核心编程.org
*** 静态方法和类方法
+ 使用类名来调用静态方法和类方法
+ 类方法的第一个参数是类,而不是实例
+ 使用函数修饰符将一个函数变为静态方法或类方法
#+BEGIN_QUOTE
#+BEGIN_SRC python
class TestStaticMethod:
    @staticmethod
    def foo():
        print 'calling static method foo()'

class TestClassMethod:
    @classmethod
    def foo(cls):
        print 'calling class method foo()'
        print 'foo() is part of class:', cls.__name__
#+END_SRC
#+END_QUOTE
+ 使用staticmethod()和classmethod()内建函数将一个函数变为静态方法或类方法
#+BEGIN_QUOTE
#+BEGIN_SRC python
class TestStaticMethod:
    def foo():
        print 'calling static method foo()'
    foo = staticmethod(foo)

class TestClassMethod:
    def foo(cls):
        print 'calling class method foo()'
        print 'foo() is part of class:', cls.__name__
    foo = classmethod(foo)
#+END_SRC
#+END_QUOTE
** 继承
*** 创建子类
#+BEGIN_SRC python
class SubClassName (ParentClass1[, ParentClass2, ...]):
    ...
#+END_SRC
*** 继承
+ 一个子类可以继承它的基类的任何属性,不管是数据属性还是方法
+ __bases__属性是一个包含父类的元组
+ 子类可以覆盖基类的方法
#+BEGIN_QUOTE
#+BEGIN_SRC python
class P(object):
    def foo(self):
        print 'Hi, I am P-foo()'

class C(P):
    def foo(self):
        print 'Hi, I am C-foo()'
#+END_SRC
#+END_QUOTE
+ 子类覆盖基类的方法后,访问基类方法的几种办法
#+BEGIN_QUOTE
#+BEGIN_SRC python
>>> P.foo(c)

class C(P):
    def foo(self):
        P.foo(self)
        print 'Hi, I am C-foo()'

class C(P):
    def foo(self):
        super(C, self).foo()
        print 'Hi, I am C-foo()'
#+END_SRC
#+END_QUOTE

** 内建函数
#+BEGIN_SRC python
#如果类sub是类sup的子类,则返回True,否则,返回False
issubclass(sub, sup)

#如果实例obj1是类obj2(或其子类)的一个实例,返回True;
#如果obj1是obj2的类型,返回True;否则,返回False
isinstance(obj1, obj2)

#如果obj有属性attr(用字符串给出),返回True,否则,返回False
hasattr(obj, attr)

#获取obj的attr属性;类似于obj.attr;若obj没有attr属性但提供了默认值,则返回默认值;
#否则,引发一个AttributeError异常
getattr(obj, attr[, default])

#设置obj的attr属性值为val,若属性已存在则替换,若属性不存在则创建;类似于obj.attr=val
setattr(obj, attr, val)

#从obj中删除属性attr(以字符串给出);类似于del obj.attr
delattr(obj, attr)

#返回obj的属性的一个列表;如果没有给定obj,则显示局部名字空间空间中的属性,等同于locals().keys()
dir(obj=None)

#返回obj的属性及其值的一个字典;如果没有给出obj,显示局部名字空间字典(属性及其值),等同于locals()
vars(obj=None)

#返回一个表示父类类型的代理对象;
#如果obj为None,返回非绑定的super对象;
#如果obj是一个类或者类型,issubclass(obj,type)必为True;
#如果obj是一个实例,isinstance(obj,type)就必为True
super(type, obj=None)
#+END_SRC
** 私有化
+ 默认情况下,属性在Python中都是公有的
+ 名字由双下划线开始的属性不能直接访问
+ 但可以通过_ClassName__attributename来间接访问

* 执行环境
** 执行代码对象(或代码字符串)
+ 代码对象
+ 可调用对象
  - 每个可调用对象的核心都是代码对象
  - 代码对象不包含任何关于它们执行环境的信息,而可调用对象可以包装一个代码对象并提供额外的信息(如函数,方法等)
