html/python核心编程.html

<div id="outline-container-10-3-1" class="outline-4">
<h4 id="sec-10-3-1"><span class="section-number-4">10.3.1</span> 静态方法和类方法</h4>
<div class="outline-text-4" id="text-10-3-1">

<ul>
<li>使用类名来调用静态方法和类方法
</li>
<li>类方法的第一个参数是类,而不是实例
</li>
<li>使用函数修饰符将一个函数变为静态方法或类方法
</li>
</ul>

<blockquote>




<pre class="src src-python"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">TestStaticMethod</span>:
    <span style="color: #228b22;">@staticmethod</span>
    <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">foo</span>():
        <span style="color: #a020f0;">print</span> <span style="color: #8b2252;">'calling static method foo()'</span>

<span style="color: #a020f0;">class</span> <span style="color: #228b22;">TestClassMethod</span>:
    <span style="color: #228b22;">@classmethod</span>
    <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">foo</span>(cls):
        <span style="color: #a020f0;">print</span> <span style="color: #8b2252;">'calling class method foo()'</span>
        <span style="color: #a020f0;">print</span> <span style="color: #8b2252;">'foo() is part of class:'</span>, cls.<span style="color: #483d8b;">__name__</span>
</pre>


</blockquote>


<ul>
<li>使用staticmethod()和classmethod()内建函数将一个函数变为静态方法或类方法
</li>
</ul>

<blockquote>




<pre class="src src-python"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">TestStaticMethod</span>:
    <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">foo</span>():
        <span style="color: #a020f0;">print</span> <span style="color: #8b2252;">'calling static method foo()'</span>
    <span style="color: #a0522d;">foo</span> = <span style="color: #483d8b;">staticmethod</span>(foo)

<span style="color: #a020f0;">class</span> <span style="color: #228b22;">TestClassMethod</span>:
    <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">foo</span>(cls):
        <span style="color: #a020f0;">print</span> <span style="color: #8b2252;">'calling class method foo()'</span>
        <span style="color: #a020f0;">print</span> <span style="color: #8b2252;">'foo() is part of class:'</span>, cls.<span style="color: #483d8b;">__name__</span>
    <span style="color: #a0522d;">foo</span> = <span style="color: #483d8b;">classmethod</span>(foo)
</pre>


</blockquote>


</div>
</div>

</div>

<div id="outline-container-10-4" class="outline-3">
<h3 id="sec-10-4"><span class="section-number-3">10.4</span> 继承</h3>
<div class="outline-text-3" id="text-10-4">


</div>

<div id="outline-container-10-4-1" class="outline-4">
<h4 id="sec-10-4-1"><span class="section-number-4">10.4.1</span> 创建子类</h4>
<div class="outline-text-4" id="text-10-4-1">




<pre class="src src-python"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">SubClassName</span> (ParentClass1[, ParentClass2, ...]):
    ...
</pre>

</div>

</div>

<div id="outline-container-10-4-2" class="outline-4">
<h4 id="sec-10-4-2"><span class="section-number-4">10.4.2</span> 继承</h4>
<div class="outline-text-4" id="text-10-4-2">

<ul>
<li>一个子类可以继承它的基类的任何属性,不管是数据属性还是方法
</li>
<li>__bases__属性是一个包含父类的元组
</li>
<li>子类可以覆盖基类的方法
</li>
</ul>

<blockquote>




<pre class="src src-python"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">P</span>(<span style="color: #483d8b;">object</span>):
    <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">foo</span>(<span style="color: #a020f0;">self</span>):
        <span style="color: #a020f0;">print</span> <span style="color: #8b2252;">'Hi, I am P-foo()'</span>

<span style="color: #a020f0;">class</span> <span style="color: #228b22;">C</span>(P):
    <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">foo</span>(<span style="color: #a020f0;">self</span>):
        <span style="color: #a020f0;">print</span> <span style="color: #8b2252;">'Hi, I am C-foo()'</span>
</pre>


</blockquote>


<ul>
<li>子类覆盖基类的方法后,访问基类方法的几种办法
</li>
</ul>

<blockquote>




<pre class="src src-python">&gt;&gt;&gt; P.foo(c)

<span style="color: #a020f0;">class</span> <span style="color: #228b22;">C</span>(P):
    <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">foo</span>(<span style="color: #a020f0;">self</span>):
        P.foo(<span style="color: #a020f0;">self</span>)
        <span style="color: #a020f0;">print</span> <span style="color: #8b2252;">'Hi, I am C-foo()'</span>

<span style="color: #a020f0;">class</span> <span style="color: #228b22;">C</span>(P):
    <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">foo</span>(<span style="color: #a020f0;">self</span>):
        <span style="color: #483d8b;">super</span>(C, <span style="color: #a020f0;">self</span>).foo()
        <span style="color: #a020f0;">print</span> <span style="color: #8b2252;">'Hi, I am C-foo()'</span>
</pre>


</blockquote>


</div>
</div>

</div>

<div id="outline-container-10-5" class="outline-3">
<h3 id="sec-10-5"><span class="section-number-3">10.5</span> 内建函数</h3>
<div class="outline-text-3" id="text-10-5">




<pre class="src src-python"><span style="color: #b22222;">#</span><span style="color: #b22222;">&#22914;&#26524;&#31867;sub&#26159;&#31867;sup&#30340;&#23376;&#31867;,&#21017;&#36820;&#22238;True,&#21542;&#21017;,&#36820;&#22238;False</span>
<span style="color: #483d8b;">issubclass</span>(sub, sup)

<span style="color: #b22222;">#</span><span style="color: #b22222;">&#22914;&#26524;&#23454;&#20363;obj1&#26159;&#31867;obj2(&#25110;&#20854;&#23376;&#31867;)&#30340;&#19968;&#20010;&#23454;&#20363;,&#36820;&#22238;True;</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">&#22914;&#26524;obj1&#26159;obj2&#30340;&#31867;&#22411;,&#36820;&#22238;True;&#21542;&#21017;,&#36820;&#22238;False</span>
<span style="color: #483d8b;">isinstance</span>(obj1, obj2)

<span style="color: #b22222;">#</span><span style="color: #b22222;">&#22914;&#26524;obj&#26377;&#23646;&#24615;attr(&#29992;&#23383;&#31526;&#20018;&#32473;&#20986;),&#36820;&#22238;True,&#21542;&#21017;,&#36820;&#22238;False</span>
<span style="color: #483d8b;">hasattr</span>(obj, attr)

<span style="color: #b22222;">#</span><span style="color: #b22222;">&#33719;&#21462;obj&#30340;attr&#23646;&#24615;;&#31867;&#20284;&#20110;obj.attr;&#33509;obj&#27809;&#26377;attr&#23646;&#24615;&#20294;&#25552;&#20379;&#20102;&#40664;&#35748;&#20540;,&#21017;&#36820;&#22238;&#40664;&#35748;&#20540;;</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">&#21542;&#21017;,&#24341;&#21457;&#19968;&#20010;AttributeError&#24322;&#24120;</span>
<span style="color: #483d8b;">getattr</span>(obj, attr[, default])

<span style="color: #b22222;">#</span><span style="color: #b22222;">&#35774;&#32622;obj&#30340;attr&#23646;&#24615;&#20540;&#20026;val,&#33509;&#23646;&#24615;&#24050;&#23384;&#22312;&#21017;&#26367;&#25442;,&#33509;&#23646;&#24615;&#19981;&#23384;&#22312;&#21017;&#21019;&#24314;;&#31867;&#20284;&#20110;obj.attr=val</span>
<span style="color: #483d8b;">setattr</span>(obj, attr, val)

<span style="color: #b22222;">#</span><span style="color: #b22222;">&#20174;obj&#20013;&#21024;&#38500;&#23646;&#24615;attr(&#20197;&#23383;&#31526;&#20018;&#32473;&#20986;);&#31867;&#20284;&#20110;del obj.attr</span>
<span style="color: #483d8b;">delattr</span>(obj, attr)

<span style="color: #b22222;">#</span><span style="color: #b22222;">&#36820;&#22238;obj&#30340;&#23646;&#24615;&#30340;&#19968;&#20010;&#21015;&#34920;;&#22914;&#26524;&#27809;&#26377;&#32473;&#23450;obj,&#21017;&#26174;&#31034;&#23616;&#37096;&#21517;&#23383;&#31354;&#38388;&#31354;&#38388;&#20013;&#30340;&#23646;&#24615;,&#31561;&#21516;&#20110;locals().keys()</span>
<span style="color: #483d8b;">dir</span>(obj=<span style="color: #008b8b;">None</span>)

<span style="color: #b22222;">#</span><span style="color: #b22222;">&#36820;&#22238;obj&#30340;&#23646;&#24615;&#21450;&#20854;&#20540;&#30340;&#19968;&#20010;&#23383;&#20856;;&#22914;&#26524;&#27809;&#26377;&#32473;&#20986;obj,&#26174;&#31034;&#23616;&#37096;&#21517;&#23383;&#31354;&#38388;&#23383;&#20856;(&#23646;&#24615;&#21450;&#20854;&#20540;),&#31561;&#21516;&#20110;locals()</span>
<span style="color: #483d8b;">vars</span>(obj=<span style="color: #008b8b;">None</span>)

<span style="color: #b22222;">#</span><span style="color: #b22222;">&#36820;&#22238;&#19968;&#20010;&#34920;&#31034;&#29238;&#31867;&#31867;&#22411;&#30340;&#20195;&#29702;&#23545;&#35937;;</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">&#22914;&#26524;obj&#20026;None,&#36820;&#22238;&#38750;&#32465;&#23450;&#30340;super&#23545;&#35937;;</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">&#22914;&#26524;obj&#26159;&#19968;&#20010;&#31867;&#25110;&#32773;&#31867;&#22411;,issubclass(obj,type)&#24517;&#20026;True;</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">&#22914;&#26524;obj&#26159;&#19968;&#20010;&#23454;&#20363;,isinstance(obj,type)&#23601;&#24517;&#20026;True</span>
<span style="color: #483d8b;">super</span>(<span style="color: #483d8b;">type</span>, obj=<span style="color: #008b8b;">None</span>)
</pre>

</div>

</div>

<div id="outline-container-10-6" class="outline-3">
<h3 id="sec-10-6"><span class="section-number-3">10.6</span> 私有化</h3>
<div class="outline-text-3" id="text-10-6">

<ul>
<li>默认情况下,属性在Python中都是公有的
</li>
<li>名字由双下划线开始的属性不能直接访问
</li>
<li>但可以通过_ClassName__attributename来间接访问
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> 执行环境</h2>
<div class="outline-text-2" id="text-11">


</div>

<div id="outline-container-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> 执行代码对象(或代码字符串)</h3>
<div class="outline-text-3" id="text-11-1">

<ul>
<li>代码对象
</li>
<li>可调用对象
<ul>
<li>每个可调用对象的核心都是代码对象
</li>
<li>代码对象不包含任何关于它们执行环境的信息,而可调用对象可以包装一个代码对象并提供额外的信息(如函数,方法等)
</li>
</ul>

</li>
</ul>


</div>
