src/python核心编程.org
*** 内建函数
#+BEGIN_SRC python
#如果obj可调用,返回True,否则返回False
callable(obj)

#创建type类型的代码对象,type可取的值如下
#  'eval' 可求值的表达式,和eval()一起使用
#  'single' 单一可执行语句,和exec一起使用
#  'exec' 可执行语句组,和exec一起使用
#file是代码存放的地方(通常设为"")
#string是代码字符串
compile(string,file, type)

#对obj进行求值
#obj是代码对象,或字符串表达式
#可以给出全局或者/和局部的名字空间
eval(obj, globals=globals(),locals=locals())

#执行obj
#obj可以是代码对象,或者字符串,或文件对象
exec obj

#等同于eval(raw_input(prompt=”))
input(prompt='')
#+END_SRC
#+BEGIN_SRC python
>>> single_code = compile('print "Hello world!"', '', 'single')
>>> single_code
<code object ? at 120998, file "", line 0>
>>> exec single_code
Hello world!
#+END_SRC
** 执行其他python程序
*** 导入
第一次导入模块会执行模块最高级代码,将不希望执行的部分放入if __name__ == '__main__'语句中
*** exec
#+BEGIN_SRC python
f = open(filename, 'r')
exec f 
f.close()
#+END_SRC
*** execfile()
execfile()实现了上例中的功能
#+BEGIN_SRC python
execfile(filename, globals=globals(), locals=locals())
#+END_SRC 
** 执行其他非python程序
#+BEGIN_SRC python
#执行程序cmd(字符串),等待程序结束,返回退出代码(windows下,始终为0)
system(cmd)

#创建一个和父进程并行的子进程,返回两次,一次给父进程一次给子进程
fork()

execl(file, arg0,arg1,...)        # 用参数列表arg0, arg1等等执行文件
execle(file, arg0,arg1,... env)   # 同execl,但提供了环境变量字典env
execlp(cmd, arg0,arg1,...)        # execl,但在用户搜索路径下搜索完全文件路径名
execlpe(cmd, arg0, arg1,... env)  # 同execlp,但提供了环境变量字典env
execv(file, arglist)              # 除了使用参数向量列表,其他的和execl()相同
execve(file,arglist, env)         # 同execv,但提供了环境变量字典env
execvp(cmd, arglist)              # 同execl,但在用户搜索路径下搜索完全文件路径名
execvpe(cmd,arglist, env)         # 同execvp,但提供了环境变量字典env

# spawn*()家族类似exec*()家族,也含有8个函数
#spawn*()在一个新的进程中执行路径,args作为参数,也许还有环境变量的字典 env;
#模式(mode)是个显示不同操作模式的魔术
spawn*(mode, file, args[, env])

wait()                #等待子进程完成[通常和 fock 和 exec*()一起使用]
waitpid(pid,options)  #等待指定的子进程完成[通常和 fock 和 exec*()一起使用]

#执行字符串cmd,返回一个类文件对象作为运行程序通信句柄,默认为读取模式和默认系统缓冲
popen(cmd, mode='r',buffering=-1)
#+END_SRC
+ system()保留了现有标准文件,任何的命令(程序)的输出都会传到标准输出.system()通常和不会产生输出的命令一起使用
+ popen()的例子
#+BEGIN_SRC python
>>> import os
>>> f = os.popen('uname -a')
>>> data = f.readline()
>>> f.close()
>>> print data,
Linux solo 2.2.13 #1 Mon Nov 8 15:08:22 CET 1999 i586 unknown
#+END_SRC
+ 调用fork()的原始进程称为父进程,而作为该调用结果新创建的进程则称为子进程。当子进程返回的时候,其返回值永远是0;当父进程返回时,其返回值永远是子进程的进程标识符.
+ fork()的经典用法
#+BEGIN_SRC python
ret = os.fork()           #产生两个进程,都返回
if ret == 0:              #子进程返回的PID是0
    child_suite           #子进程的代码
else:                     #父进程返回是子进程的PID
    parent_suite          #父进程的代码
#+END_SRC
** 结束执行
*** sys.exit()
#+BEGIN_SRC python
sys.exit(status=0)
#+END_SRC
调用sys.exit()时会引发SystemExit异常
**** sys.exitfunc()
sys.exitfunc()默认是不可用的,可以改写它进行退出前的扫尾工作。当调用了sys.exit(),会在解释器退出之前执行这个函数
*** os._exit()
#+BEGIN_SRC python
os._exit(status)
#+END_SRC
不执行任何清理便立即退出python
*** os.kill()
给进程发送信号
