html/python核心编程.html

<div id="outline-container-11-1-1" class="outline-4">
<h4 id="sec-11-1-1"><span class="section-number-4">11.1.1</span> 内建函数</h4>
<div class="outline-text-4" id="text-11-1-1">




<pre class="src src-python"><span style="color: #b22222;">#</span><span style="color: #b22222;">&#22914;&#26524;obj&#21487;&#35843;&#29992;,&#36820;&#22238;True,&#21542;&#21017;&#36820;&#22238;False</span>
<span style="color: #483d8b;">callable</span>(obj)

<span style="color: #b22222;">#</span><span style="color: #b22222;">&#21019;&#24314;type&#31867;&#22411;&#30340;&#20195;&#30721;&#23545;&#35937;,type&#21487;&#21462;&#30340;&#20540;&#22914;&#19979;</span>
<span style="color: #b22222;">#  </span><span style="color: #b22222;">'eval' &#21487;&#27714;&#20540;&#30340;&#34920;&#36798;&#24335;,&#21644;eval()&#19968;&#36215;&#20351;&#29992;</span>
<span style="color: #b22222;">#  </span><span style="color: #b22222;">'single' &#21333;&#19968;&#21487;&#25191;&#34892;&#35821;&#21477;,&#21644;exec&#19968;&#36215;&#20351;&#29992;</span>
<span style="color: #b22222;">#  </span><span style="color: #b22222;">'exec' &#21487;&#25191;&#34892;&#35821;&#21477;&#32452;,&#21644;exec&#19968;&#36215;&#20351;&#29992;</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">file&#26159;&#20195;&#30721;&#23384;&#25918;&#30340;&#22320;&#26041;(&#36890;&#24120;&#35774;&#20026;"")</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">string&#26159;&#20195;&#30721;&#23383;&#31526;&#20018;</span>
<span style="color: #483d8b;">compile</span>(string,<span style="color: #483d8b;">file</span>, <span style="color: #483d8b;">type</span>)

<span style="color: #b22222;">#</span><span style="color: #b22222;">&#23545;obj&#36827;&#34892;&#27714;&#20540;</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">obj&#26159;&#20195;&#30721;&#23545;&#35937;,&#25110;&#23383;&#31526;&#20018;&#34920;&#36798;&#24335;</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">&#21487;&#20197;&#32473;&#20986;&#20840;&#23616;&#25110;&#32773;/&#21644;&#23616;&#37096;&#30340;&#21517;&#23383;&#31354;&#38388;</span>
<span style="color: #483d8b;">eval</span>(obj, <span style="color: #483d8b;">globals</span>=<span style="color: #483d8b;">globals</span>(),<span style="color: #483d8b;">locals</span>=<span style="color: #483d8b;">locals</span>())

<span style="color: #b22222;">#</span><span style="color: #b22222;">&#25191;&#34892;obj</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">obj&#21487;&#20197;&#26159;&#20195;&#30721;&#23545;&#35937;,&#25110;&#32773;&#23383;&#31526;&#20018;,&#25110;&#25991;&#20214;&#23545;&#35937;</span>
<span style="color: #a020f0;">exec</span> obj

<span style="color: #b22222;">#</span><span style="color: #b22222;">&#31561;&#21516;&#20110;eval(raw_input(prompt=&#8221;))</span>
<span style="color: #483d8b;">input</span>(prompt=<span style="color: #8b2252;">''</span>)
</pre>


<pre class="src src-python">&gt;&gt;&gt; <span style="color: #a0522d;">single_code</span> = <span style="color: #483d8b;">compile</span>(<span style="color: #8b2252;">'print "Hello world!"'</span>, <span style="color: #8b2252;">''</span>, <span style="color: #8b2252;">'single'</span>)
&gt;&gt;&gt; single_code
&lt;code <span style="color: #483d8b;">object</span> ? at 120998, <span style="color: #483d8b;">file</span> <span style="color: #8b2252;">""</span>, line 0&gt;
&gt;&gt;&gt; <span style="color: #a020f0;">exec</span> single_code
Hello world!
</pre>

</div>
</div>

</div>

<div id="outline-container-11-2" class="outline-3">
<h3 id="sec-11-2"><span class="section-number-3">11.2</span> 执行其他python程序</h3>
<div class="outline-text-3" id="text-11-2">


</div>

<div id="outline-container-11-2-1" class="outline-4">
<h4 id="sec-11-2-1"><span class="section-number-4">11.2.1</span> 导入</h4>
<div class="outline-text-4" id="text-11-2-1">

<p>第一次导入模块会执行模块最高级代码,将不希望执行的部分放入if __name__ == '__main__'语句中
</p></div>

</div>

<div id="outline-container-11-2-2" class="outline-4">
<h4 id="sec-11-2-2"><span class="section-number-4">11.2.2</span> exec</h4>
<div class="outline-text-4" id="text-11-2-2">




<pre class="src src-python"><span style="color: #a0522d;">f</span> = <span style="color: #483d8b;">open</span>(filename, <span style="color: #8b2252;">'r'</span>)
<span style="color: #a020f0;">exec</span> f 
f.close()
</pre>

</div>

</div>

<div id="outline-container-11-2-3" class="outline-4">
<h4 id="sec-11-2-3"><span class="section-number-4">11.2.3</span> execfile()</h4>
<div class="outline-text-4" id="text-11-2-3">

<p>execfile()实现了上例中的功能
</p>


<pre class="src src-python"><span style="color: #483d8b;">execfile</span>(filename, <span style="color: #483d8b;">globals</span>=<span style="color: #483d8b;">globals</span>(), <span style="color: #483d8b;">locals</span>=<span style="color: #483d8b;">locals</span>())
</pre>

</div>
</div>

</div>

<div id="outline-container-11-3" class="outline-3">
<h3 id="sec-11-3"><span class="section-number-3">11.3</span> 执行其他非python程序</h3>
<div class="outline-text-3" id="text-11-3">




<pre class="src src-python"><span style="color: #b22222;">#</span><span style="color: #b22222;">&#25191;&#34892;&#31243;&#24207;cmd(&#23383;&#31526;&#20018;),&#31561;&#24453;&#31243;&#24207;&#32467;&#26463;,&#36820;&#22238;&#36864;&#20986;&#20195;&#30721;(windows&#19979;,&#22987;&#32456;&#20026;0)</span>
system(cmd)

<span style="color: #b22222;">#</span><span style="color: #b22222;">&#21019;&#24314;&#19968;&#20010;&#21644;&#29238;&#36827;&#31243;&#24182;&#34892;&#30340;&#23376;&#36827;&#31243;,&#36820;&#22238;&#20004;&#27425;,&#19968;&#27425;&#32473;&#29238;&#36827;&#31243;&#19968;&#27425;&#32473;&#23376;&#36827;&#31243;</span>
fork()

execl(<span style="color: #483d8b;">file</span>, arg0,arg1,...)        <span style="color: #b22222;"># </span><span style="color: #b22222;">&#29992;&#21442;&#25968;&#21015;&#34920;arg0, arg1&#31561;&#31561;&#25191;&#34892;&#25991;&#20214;</span>
execle(<span style="color: #483d8b;">file</span>, arg0,arg1,... env)   <span style="color: #b22222;"># </span><span style="color: #b22222;">&#21516;execl,&#20294;&#25552;&#20379;&#20102;&#29615;&#22659;&#21464;&#37327;&#23383;&#20856;env</span>
execlp(cmd, arg0,arg1,...)        <span style="color: #b22222;"># </span><span style="color: #b22222;">execl,&#20294;&#22312;&#29992;&#25143;&#25628;&#32034;&#36335;&#24452;&#19979;&#25628;&#32034;&#23436;&#20840;&#25991;&#20214;&#36335;&#24452;&#21517;</span>
execlpe(cmd, arg0, arg1,... env)  <span style="color: #b22222;"># </span><span style="color: #b22222;">&#21516;execlp,&#20294;&#25552;&#20379;&#20102;&#29615;&#22659;&#21464;&#37327;&#23383;&#20856;env</span>
execv(<span style="color: #483d8b;">file</span>, arglist)              <span style="color: #b22222;"># </span><span style="color: #b22222;">&#38500;&#20102;&#20351;&#29992;&#21442;&#25968;&#21521;&#37327;&#21015;&#34920;,&#20854;&#20182;&#30340;&#21644;execl()&#30456;&#21516;</span>
execve(<span style="color: #483d8b;">file</span>,arglist, env)         <span style="color: #b22222;"># </span><span style="color: #b22222;">&#21516;execv,&#20294;&#25552;&#20379;&#20102;&#29615;&#22659;&#21464;&#37327;&#23383;&#20856;env</span>
execvp(cmd, arglist)              <span style="color: #b22222;"># </span><span style="color: #b22222;">&#21516;execl,&#20294;&#22312;&#29992;&#25143;&#25628;&#32034;&#36335;&#24452;&#19979;&#25628;&#32034;&#23436;&#20840;&#25991;&#20214;&#36335;&#24452;&#21517;</span>
execvpe(cmd,arglist, env)         <span style="color: #b22222;"># </span><span style="color: #b22222;">&#21516;execvp,&#20294;&#25552;&#20379;&#20102;&#29615;&#22659;&#21464;&#37327;&#23383;&#20856;env</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">spawn*()&#23478;&#26063;&#31867;&#20284;exec*()&#23478;&#26063;,&#20063;&#21547;&#26377;8&#20010;&#20989;&#25968;</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">spawn*()&#22312;&#19968;&#20010;&#26032;&#30340;&#36827;&#31243;&#20013;&#25191;&#34892;&#36335;&#24452;,args&#20316;&#20026;&#21442;&#25968;,&#20063;&#35768;&#36824;&#26377;&#29615;&#22659;&#21464;&#37327;&#30340;&#23383;&#20856; env;</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">&#27169;&#24335;(mode)&#26159;&#20010;&#26174;&#31034;&#19981;&#21516;&#25805;&#20316;&#27169;&#24335;&#30340;&#39764;&#26415;</span>
spawn*(mode, <span style="color: #483d8b;">file</span>, args[, env])

wait()                <span style="color: #b22222;">#</span><span style="color: #b22222;">&#31561;&#24453;&#23376;&#36827;&#31243;&#23436;&#25104;[&#36890;&#24120;&#21644; fock &#21644; exec*()&#19968;&#36215;&#20351;&#29992;]</span>
waitpid(pid,options)  <span style="color: #b22222;">#</span><span style="color: #b22222;">&#31561;&#24453;&#25351;&#23450;&#30340;&#23376;&#36827;&#31243;&#23436;&#25104;[&#36890;&#24120;&#21644; fock &#21644; exec*()&#19968;&#36215;&#20351;&#29992;]</span>

<span style="color: #b22222;">#</span><span style="color: #b22222;">&#25191;&#34892;&#23383;&#31526;&#20018;cmd,&#36820;&#22238;&#19968;&#20010;&#31867;&#25991;&#20214;&#23545;&#35937;&#20316;&#20026;&#36816;&#34892;&#31243;&#24207;&#36890;&#20449;&#21477;&#26564;,&#40664;&#35748;&#20026;&#35835;&#21462;&#27169;&#24335;&#21644;&#40664;&#35748;&#31995;&#32479;&#32531;&#20914;</span>
popen(cmd, mode=<span style="color: #8b2252;">'r'</span>,buffering=-1)
</pre>

<ul>
<li>system()保留了现有标准文件,任何的命令(程序)的输出都会传到标准输出.system()通常和不会产生输出的命令一起使用
</li>
<li>popen()的例子
</li>
</ul>




<pre class="src src-python">&gt;&gt;&gt; <span style="color: #a020f0;">import</span> os
&gt;&gt;&gt; <span style="color: #a0522d;">f</span> = os.popen(<span style="color: #8b2252;">'uname -a'</span>)
&gt;&gt;&gt; <span style="color: #a0522d;">data</span> = f.readline()
&gt;&gt;&gt; f.close()
&gt;&gt;&gt; <span style="color: #a020f0;">print</span> data,
Linux solo 2.2.13 <span style="color: #b22222;">#</span><span style="color: #b22222;">1 Mon Nov 8 15:08:22 CET 1999 i586 unknown</span>
</pre>

<ul>
<li>调用fork()的原始进程称为父进程,而作为该调用结果新创建的进程则称为子进程。当子进程返回的时候,其返回值永远是0;当父进程返回时,其返回值永远是子进程的进程标识符.
</li>
<li>fork()的经典用法
</li>
</ul>




<pre class="src src-python"><span style="color: #a0522d;">ret</span> = os.fork()           <span style="color: #b22222;">#</span><span style="color: #b22222;">&#20135;&#29983;&#20004;&#20010;&#36827;&#31243;,&#37117;&#36820;&#22238;</span>
<span style="color: #a020f0;">if</span> ret == 0:              <span style="color: #b22222;">#</span><span style="color: #b22222;">&#23376;&#36827;&#31243;&#36820;&#22238;&#30340;PID&#26159;0</span>
    child_suite           <span style="color: #b22222;">#</span><span style="color: #b22222;">&#23376;&#36827;&#31243;&#30340;&#20195;&#30721;</span>
<span style="color: #a020f0;">else</span>:                     <span style="color: #b22222;">#</span><span style="color: #b22222;">&#29238;&#36827;&#31243;&#36820;&#22238;&#26159;&#23376;&#36827;&#31243;&#30340;PID</span>
    parent_suite          <span style="color: #b22222;">#</span><span style="color: #b22222;">&#29238;&#36827;&#31243;&#30340;&#20195;&#30721;</span>
</pre>

</div>

</div>

<div id="outline-container-11-4" class="outline-3">
<h3 id="sec-11-4"><span class="section-number-3">11.4</span> 结束执行</h3>
<div class="outline-text-3" id="text-11-4">


</div>

<div id="outline-container-11-4-1" class="outline-4">
<h4 id="sec-11-4-1"><span class="section-number-4">11.4.1</span> sys.exit()</h4>
<div class="outline-text-4" id="text-11-4-1">




<pre class="src src-python">sys.<span style="color: #008b8b;">exit</span>(status=0)
</pre>

<p>
调用sys.exit()时会引发SystemExit异常
</p><ul>
<li id="sec-11-4-1-1">sys.exitfunc()<br/>
sys.exitfunc()默认是不可用的,可以改写它进行退出前的扫尾工作。当调用了sys.exit(),会在解释器退出之前执行这个函数
</li>
</ul>
</div>

</div>

<div id="outline-container-11-4-2" class="outline-4">
<h4 id="sec-11-4-2"><span class="section-number-4">11.4.2</span> os._exit()</h4>
<div class="outline-text-4" id="text-11-4-2">




<pre class="src src-python">os._exit(status)
</pre>

<p>
不执行任何清理便立即退出python
</p></div>

</div>

<div id="outline-container-11-4-3" class="outline-4">
<h4 id="sec-11-4-3"><span class="section-number-4">11.4.3</span> os.kill()</h4>
<div class="outline-text-4" id="text-11-4-3">

<p>给进程发送信号
</p></div>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-09-08T12:45+0800</p>
<p class="author">Author: 王超</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
